{
  "bugs": [
    {
      "cve": null,
      "title": "Add SCRAM-SHA-256 support for password negotiation and storage",
      "description": "Add SCRAM-SHA-256 support for password negotiation and storage (Michael Paquier, Heikki Linnakangas)\nThis provides better security than the existing `md5` negotiation and storage method.",
      "fixedIn": "10.0",
      "contributor": "Michael Paquier, Heikki Linnakangas"
    },
    {
      "cve": null,
      "title": "Allow restrictive row-level security policies",
      "description": "Allow restrictive row-level security policies (Stephen Frost)\nPreviously all security policies were permissive, meaning that any matching policy allowed access. A restrictive policy must match for access to be granted. These policy types can be combined.",
      "fixedIn": "10.0",
      "contributor": "Stephen Frost"
    },
    {
      "cve": null,
      "title": "Issue `fsync",
      "description": "Issue `fsync()()` on the output files generated by pg_dump and pg_dumpall (Michael Paquier)\nThis provides more security that the output is safely stored on disk before the program exits. This can be disabled with the new --no-sync option.",
      "fixedIn": "10.0",
      "contributor": "Michael Paquier"
    },
    {
      "cve": "CVE-2017-15099",
      "title": "Ensure that `INSERT ... ON CONFLICT DO UPDATE` checks table permissions and RLS policies in all cases",
      "description": "Ensure that `INSERT ... ON CONFLICT DO UPDATE` checks table permissions and RLS policies in all cases (Dean Rasheed)\nThe update path of `INSERT ... ON CONFLICT DO UPDATE` requires `SELECT` permission on the columns of the arbiter index, but it failed to check for that in the case of an arbiter specified by constraint name. In addition, for a table with row level security enabled, it failed to check updated rows against the table's `SELECT` policies (regardless of how the arbiter index was specified). (CVE-2017-15099)",
      "fixedIn": "10.1",
      "contributor": "CVE-2017-15099"
    },
    {
      "cve": null,
      "title": "Fix handling of whole-row variables in `WITH CHECK OPTION` expressions and row-level-security policy expressions",
      "description": "Fix handling of whole-row variables in `WITH CHECK OPTION` expressions and row-level-security policy expressions (Andres Freund)\nPreviously, such usage might result in bogus errors about row type mismatches.",
      "fixedIn": "10.11",
      "contributor": "Andres Freund"
    },
    {
      "cve": null,
      "title": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects",
      "description": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects (Benjie Gillam)\nPreviously, if two triggers on different tables had the same names, they would be sorted in OID-based order, which is less desirable than sorting them by table name. Likewise for RLS policies.",
      "fixedIn": "10.11",
      "contributor": "Benjie Gillam"
    },
    {
      "cve": "CVE-2020-25695",
      "title": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries",
      "description": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries (Noah Misch)\nThis is essentially a leak in the “security restricted operation” sandbox mechanism. An attacker having permission to create non-temporary SQL objects could parlay this leak to execute arbitrary SQL code as a superuser.\nThe PostgreSQL Project thanks Etienne Stalmans for reporting this problem. (CVE-2020-25695)",
      "fixedIn": "10.15",
      "contributor": "CVE-2020-25695"
    },
    {
      "cve": null,
      "title": "Make libpq support arbitrary-length lines in .pgpass files",
      "description": "Make libpq support arbitrary-length lines in .pgpass files (Tom Lane)\nThis is mostly useful to allow using very long security tokens as passwords.",
      "fixedIn": "10.15",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2006-2313",
      "title": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data",
      "description": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data (Tom Lane)\nAn incorrectly-encoded multibyte character near the end of a string could cause various processing loops to run past the string's terminating NUL, with results ranging from no detectable issue to a program crash, depending on what happens to be in the following memory. This is reminiscent of CVE-2006-2313, although these particular cases do not appear to have interesting security consequences.",
      "fixedIn": "10.18",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Ensure that `GetSharedSecurityLabel",
      "description": "Ensure that `GetSharedSecurityLabel()()` can be used in a newly-started session that has not yet built its critical relation cache entries (Jeff Davis)",
      "fixedIn": "10.19",
      "contributor": "Jeff Davis"
    },
    {
      "cve": null,
      "title": "Fix pg_dump to make ACL",
      "description": "Fix pg_dump to make ACL (permissions), comment, and security label entries reliably identifiable in archive output formats (Tom Lane)\nThe “tag” portion of an ACL archive entry was usually just the name of the associated object. Make it start with the object type instead, bringing ACLs into line with the convention already used for comment and security label archive entries. Also, fix the comment and security label entries for the whole database, if present, to make their tags start with `DATABASE` so that they also follow this convention. This prevents false matches in code that tries to identify large-object-related entries by seeing if the tag starts with `LARGE OBJECT`. That could have resulted in misclassifying entries as data rather than schema, with undesirable results in a schema-only or data-only dump.\nNote that this change has user-visible results in the output of pg_restore --list.",
      "fixedIn": "10.2",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2022-1552",
      "title": "Confine additional operations within “security restricted operation” sandboxes",
      "description": "Confine additional operations within “security restricted operation” sandboxes (Sergey Shinderuk, Noah Misch)\nAutovacuum, CLUSTER, CREATE INDEX, REINDEX, REFRESH MATERIALIZED VIEW, and pg_amcheck activated the “security restricted operation” protection mechanism too late, or even not at all in some code paths. A user having permission to create non-temporary objects within a database could define an object that would execute arbitrary SQL code with superuser permissions the next time that autovacuum processed the object, or that some superuser ran one of the affected commands against it.\nThe PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2022-1552)",
      "fixedIn": "10.21",
      "contributor": "CVE-2022-1552"
    },
    {
      "cve": null,
      "title": "Disallow execution of SPI functions during PL/Perl function compilation",
      "description": "Disallow execution of SPI functions during PL/Perl function compilation (Tom Lane)\nPerl can be convinced to execute user-defined code during compilation of a PL/Perl function. However, it's not okay for such code to try to invoke SQL operations via SPI. That results in a crash, and if it didn't crash it would be a security hazard, because we really don't want code execution during function validation. Put in a check to give a friendlier error message instead.",
      "fixedIn": "10.21",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2018-1058",
      "title": "Document how to configure installations and applications to guard against search-path-dependent trojan-horse attacks from other users",
      "description": "Document how to configure installations and applications to guard against search-path-dependent trojan-horse attacks from other users (Noah Misch)\nUsing a search_path setting that includes any schemas writable by a hostile user enables that user to capture control of queries and then run arbitrary SQL code with the permissions of the attacked user. While it is possible to write queries that are proof against such hijacking, it is notationally tedious, and it's very easy to overlook holes. Therefore, we now recommend configurations in which no untrusted schemas appear in one's search path. Relevant documentation appears in Section&nbsp;5.8.6 (for database administrators and users), Section&nbsp;33.1 (for application authors), Section&nbsp;37.15.6 (for extension authors), and CREATE FUNCTION (for authors of `SECURITY DEFINER` functions). (CVE-2018-1058)",
      "fixedIn": "10.3",
      "contributor": "CVE-2018-1058"
    },
    {
      "cve": "CVE-2018-1115",
      "title": "Remove public execute privilege from contrib/adminpack's `pg_logfile_rotate",
      "description": "Remove public execute privilege from contrib/adminpack's `pg_logfile_rotate()()` function (Stephen Frost)\n`pg_logfile_rotate()()` is a deprecated wrapper for the core function `pg_rotate_logfile()()`. When that function was changed to rely on SQL privileges for access control rather than a hard-coded superuser check, `pg_logfile_rotate()()` should have been updated as well, but the need for this was missed. Hence, if adminpack is installed, any user could request a logfile rotation, creating a minor security issue.\nAfter installing this update, administrators should update adminpack by performing `ALTER EXTENSION adminpack UPDATE` in each database in which adminpack is installed. (CVE-2018-1115)",
      "fixedIn": "10.4",
      "contributor": "CVE-2018-1115"
    },
    {
      "cve": "CVE-2018-10915",
      "title": "Fix failure to reset libpq's state fully between connection attempts",
      "description": "Fix failure to reset libpq's state fully between connection attempts (Tom Lane)\nAn unprivileged user of dblink or postgres_fdw could bypass the checks intended to prevent use of server-side credentials, such as a ~/.pgpass file owned by the operating-system user running the server. Servers allowing peer authentication on local connections are particularly vulnerable. Other attacks such as SQL injection into a postgres_fdw session are also possible. Attacking postgres_fdw in this way requires the ability to create a foreign server object with selected connection parameters, but any user with access to dblink could exploit the problem. In general, an attacker with the ability to select the connection parameters for a libpq-using application could cause mischief, though other plausible attack scenarios are harder to think of. Our thanks to Andrew Krasichkov for reporting this issue. (CVE-2018-10915)",
      "fixedIn": "10.5",
      "contributor": "CVE-2018-10915"
    },
    {
      "cve": "CVE-2018-16850",
      "title": "Ensure proper quoting of transition table names when pg_dump emits CREATE TRIGGER ... REFERENCING commands",
      "description": "Ensure proper quoting of transition table names when pg_dump emits CREATE TRIGGER ... REFERENCING commands (Tom Lane)\nThis oversight could be exploited by an unprivileged user to gain superuser privileges during the next dump/reload or pg_upgrade run. (CVE-2018-16850)",
      "fixedIn": "10.6",
      "contributor": "CVE-2018-16850"
    },
    {
      "cve": "CVE-2017-7484",
      "title": "Prevent row-level security policies from being bypassed via selectivity estimators",
      "description": "Prevent row-level security policies from being bypassed via selectivity estimators (Dean Rasheed)\nSome of the planner's selectivity estimators apply user-defined operators to values found in pg_statistic (e.g., most-common values). A leaky operator therefore can disclose some of the entries in a data column, even if the calling user lacks permission to read that column. In CVE-2017-7484 we added restrictions to forestall that, but we failed to consider the effects of row-level security. A user who has SQL permission to read a column, but who is forbidden to see certain rows due to RLS policy, might still learn something about those rows' contents via a leaky operator. This patch further tightens the rules, allowing leaky operators to be applied to statistics data only when there is no relevant RLS policy. (CVE-2019-10130)",
      "fixedIn": "10.8",
      "contributor": "CVE-2019-10130"
    },
    {
      "cve": null,
      "title": "Ensure that sub-SELECTs appearing in row-level-security policy expressions are executed with the correct user's permissions",
      "description": "Ensure that sub-SELECTs appearing in row-level-security policy expressions are executed with the correct user's permissions (Dean Rasheed)\nPreviously, if the table having the RLS policy was accessed via a view, such checks might be executed as the user calling the view, not as the view owner as they should be.",
      "fixedIn": "10.8",
      "contributor": "Dean Rasheed"
    },
    {
      "cve": null,
      "title": "Make pg_dump dump the properties of a database, not just its contents",
      "description": "Make pg_dump dump the properties of a database, not just its contents (Haribabu Kommi)\n          Previously, attributes of the database itself, such as database-level GRANT/REVOKE permissions and ALTER DATABASE SET variable settings, were only dumped by pg_dumpall. Now pg_dump --create and pg_restore --create will restore these database properties in addition to the objects within the database. pg_dumpall -g now only dumps role- and tablespace-related attributes. pg_dumpall's complete output (without -g) is unchanged.\n          pg_dump and pg_restore, without --create, no longer dump/restore database-level comments and security labels; those are now treated as properties of the database.\n          pg_dumpall's output script will now always create databases with their original locale and encoding, and hence will fail if the locale or encoding name is unknown to the destination system. Previously, CREATE DATABASE would be emitted without these specifications if the database locale and encoding matched the old cluster's defaults.\n          pg_dumpall --clean now restores the original locale and encoding settings of the `postgres` and `template1` databases, as well as those of user-created databases.",
      "fixedIn": "11.0",
      "contributor": "without -g"
    },
    {
      "cve": null,
      "title": "Remove the chkpass extension",
      "description": "Remove the chkpass extension (Peter Eisentraut)\n            This extension is no longer considered to be a usable security tool or example of how to write an extension.",
      "fixedIn": "11.0",
      "contributor": "Peter Eisentraut"
    },
    {
      "cve": "CVE-2018-16850",
      "title": "Ensure proper quoting of transition table names when pg_dump emits CREATE TRIGGER ... REFERENCING commands",
      "description": "Ensure proper quoting of transition table names when pg_dump emits CREATE TRIGGER ... REFERENCING commands (Tom Lane)\n          This oversight could be exploited by an unprivileged user to gain superuser privileges during the next dump/reload or pg_upgrade run. (CVE-2018-16850)",
      "fixedIn": "11.1",
      "contributor": "CVE-2018-16850"
    },
    {
      "cve": "CVE-2020-25695",
      "title": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries",
      "description": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries (Noah Misch)\n          This is essentially a leak in the “security restricted operation” sandbox mechanism. An attacker having permission to create non-temporary SQL objects could parlay this leak to execute arbitrary SQL code as a superuser.\n          The PostgreSQL Project thanks Etienne Stalmans for reporting this problem. (CVE-2020-25695)",
      "fixedIn": "11.10",
      "contributor": "CVE-2020-25695"
    },
    {
      "cve": null,
      "title": "Make libpq support arbitrary-length lines in .pgpass files",
      "description": "Make libpq support arbitrary-length lines in .pgpass files (Tom Lane)\n          This is mostly useful to allow using very long security tokens as passwords.",
      "fixedIn": "11.10",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2006-2313",
      "title": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data",
      "description": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data (Tom Lane)\n          An incorrectly-encoded multibyte character near the end of a string could cause various processing loops to run past the string's terminating NUL, with results ranging from no detectable issue to a program crash, depending on what happens to be in the following memory. This is reminiscent of CVE-2006-2313, although these particular cases do not appear to have interesting security consequences.",
      "fixedIn": "11.13",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Ensure that `GetSharedSecurityLabel",
      "description": "Ensure that `GetSharedSecurityLabel()()` can be used in a newly-started session that has not yet built its critical relation cache entries (Jeff Davis)",
      "fixedIn": "11.14",
      "contributor": "Jeff Davis"
    },
    {
      "cve": "CVE-2022-1552",
      "title": "Confine additional operations within “security restricted operation” sandboxes",
      "description": "Confine additional operations within “security restricted operation” sandboxes (Sergey Shinderuk, Noah Misch)\n          Autovacuum, CLUSTER, CREATE INDEX, REINDEX, REFRESH MATERIALIZED VIEW, and pg_amcheck activated the “security restricted operation” protection mechanism too late, or even not at all in some code paths. A user having permission to create non-temporary objects within a database could define an object that would execute arbitrary SQL code with superuser permissions the next time that autovacuum processed the object, or that some superuser ran one of the affected commands against it.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2022-1552)",
      "fixedIn": "11.16",
      "contributor": "CVE-2022-1552"
    },
    {
      "cve": null,
      "title": "Disallow execution of SPI functions during PL/Perl function compilation",
      "description": "Disallow execution of SPI functions during PL/Perl function compilation (Tom Lane)\n          Perl can be convinced to execute user-defined code during compilation of a PL/Perl function. However, it's not okay for such code to try to invoke SQL operations via SPI. That results in a crash, and if it didn't crash it would be a security hazard, because we really don't want code execution during function validation. Put in a check to give a friendlier error message instead.",
      "fixedIn": "11.16",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-2454",
      "title": "Prevent CREATE SCHEMA from defeating changes in search_path",
      "description": "Prevent CREATE SCHEMA from defeating changes in search_path (Alexander Lakhin)\n          Within a CREATE SCHEMA command, objects in the prevailing search_path, as well as those in the newly-created schema, would be visible even within a called function or script that attempted to set a secure search_path. This could allow any user having permission to create a schema to hijack the privileges of a security definer function or extension script.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2023-2454)",
      "fixedIn": "11.20",
      "contributor": "CVE-2023-2454"
    },
    {
      "cve": "CVE-2023-2455",
      "title": "Enforce row-level security policies correctly after inlining a set-returning function",
      "description": "Enforce row-level security policies correctly after inlining a set-returning function (Stephen Frost, Tom Lane)\n          If a set-returning SQL-language function refers to a table having row-level security policies, and it can be inlined into a calling query, those RLS policies would not get enforced properly in some cases involving re-using a cached plan under a different role. This could allow a user to see or modify rows that should have been invisible.\n          The PostgreSQL Project thanks Wolfgang Walther for reporting this problem. (CVE-2023-2455)",
      "fixedIn": "11.20",
      "contributor": "CVE-2023-2455"
    },
    {
      "cve": null,
      "title": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables",
      "description": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables (Antonin Houska)\n          The documentation is quite clear that COPY TO copies rows from only the named table, not any inheritance children it may have. However, if row-level security was enabled on the table then this stopped being true.",
      "fixedIn": "11.20",
      "contributor": "Antonin Houska"
    },
    {
      "cve": null,
      "title": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions",
      "description": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions (Tom Lane)",
      "fixedIn": "11.21",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "11.22",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "11.22",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2017-7484",
      "title": "Prevent row-level security policies from being bypassed via selectivity estimators",
      "description": "Prevent row-level security policies from being bypassed via selectivity estimators (Dean Rasheed)\n          Some of the planner's selectivity estimators apply user-defined operators to values found in pg_statistic (e.g., most-common values). A leaky operator therefore can disclose some of the entries in a data column, even if the calling user lacks permission to read that column. In CVE-2017-7484 we added restrictions to forestall that, but we failed to consider the effects of row-level security. A user who has SQL permission to read a column, but who is forbidden to see certain rows due to RLS policy, might still learn something about those rows' contents via a leaky operator. This patch further tightens the rules, allowing leaky operators to be applied to statistics data only when there is no relevant RLS policy. (CVE-2019-10130)",
      "fixedIn": "11.3",
      "contributor": "CVE-2019-10130"
    },
    {
      "cve": null,
      "title": "Ensure that sub-SELECTs appearing in row-level-security policy expressions are executed with the correct user's permissions",
      "description": "Ensure that sub-SELECTs appearing in row-level-security policy expressions are executed with the correct user's permissions (Dean Rasheed)\n          Previously, if the table having the RLS policy was accessed via a view, such checks might be executed as the user calling the view, not as the view owner as they should be.",
      "fixedIn": "11.3",
      "contributor": "Dean Rasheed"
    },
    {
      "cve": null,
      "title": "Fix handling of whole-row variables in `WITH CHECK OPTION` expressions and row-level-security policy expressions",
      "description": "Fix handling of whole-row variables in `WITH CHECK OPTION` expressions and row-level-security policy expressions (Andres Freund)\n          Previously, such usage might result in bogus errors about row type mismatches.",
      "fixedIn": "11.6",
      "contributor": "Andres Freund"
    },
    {
      "cve": null,
      "title": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects",
      "description": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects (Benjie Gillam)\n          Previously, if two triggers on different tables had the same names, they would be sorted in OID-based order, which is less desirable than sorting them by table name. Likewise for RLS policies.",
      "fixedIn": "11.6",
      "contributor": "Benjie Gillam"
    },
    {
      "cve": null,
      "title": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects",
      "description": "In pg_dump, ensure stable output order for similarly-named triggers and row-level-security policy objects (Benjie Gillam)\n          Previously, if two triggers on different tables had the same names, they would be sorted in OID-based order, which is less desirable than sorting them by table name. Likewise for RLS policies.",
      "fixedIn": "12.1",
      "contributor": "Benjie Gillam"
    },
    {
      "cve": "CVE-2022-1552",
      "title": "Confine additional operations within “security restricted operation” sandboxes",
      "description": "Confine additional operations within “security restricted operation” sandboxes (Sergey Shinderuk, Noah Misch)\n          Autovacuum, CLUSTER, CREATE INDEX, REINDEX, REFRESH MATERIALIZED VIEW, and pg_amcheck activated the “security restricted operation” protection mechanism too late, or even not at all in some code paths. A user having permission to create non-temporary objects within a database could define an object that would execute arbitrary SQL code with superuser permissions the next time that autovacuum processed the object, or that some superuser ran one of the affected commands against it.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2022-1552)",
      "fixedIn": "12.11",
      "contributor": "CVE-2022-1552"
    },
    {
      "cve": null,
      "title": "Disallow execution of SPI functions during PL/Perl function compilation",
      "description": "Disallow execution of SPI functions during PL/Perl function compilation (Tom Lane)\n          Perl can be convinced to execute user-defined code during compilation of a PL/Perl function. However, it's not okay for such code to try to invoke SQL operations via SPI. That results in a crash, and if it didn't crash it would be a security hazard, because we really don't want code execution during function validation. Put in a check to give a friendlier error message instead.",
      "fixedIn": "12.11",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-2454",
      "title": "Prevent CREATE SCHEMA from defeating changes in search_path",
      "description": "Prevent CREATE SCHEMA from defeating changes in search_path (Alexander Lakhin)\n          Within a CREATE SCHEMA command, objects in the prevailing search_path, as well as those in the newly-created schema, would be visible even within a called function or script that attempted to set a secure search_path. This could allow any user having permission to create a schema to hijack the privileges of a security definer function or extension script.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2023-2454)",
      "fixedIn": "12.15",
      "contributor": "CVE-2023-2454"
    },
    {
      "cve": "CVE-2023-2455",
      "title": "Enforce row-level security policies correctly after inlining a set-returning function",
      "description": "Enforce row-level security policies correctly after inlining a set-returning function (Stephen Frost, Tom Lane)\n          If a set-returning SQL-language function refers to a table having row-level security policies, and it can be inlined into a calling query, those RLS policies would not get enforced properly in some cases involving re-using a cached plan under a different role. This could allow a user to see or modify rows that should have been invisible.\n          The PostgreSQL Project thanks Wolfgang Walther for reporting this problem. (CVE-2023-2455)",
      "fixedIn": "12.15",
      "contributor": "CVE-2023-2455"
    },
    {
      "cve": null,
      "title": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables",
      "description": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables (Antonin Houska)\n          The documentation is quite clear that COPY TO copies rows from only the named table, not any inheritance children it may have. However, if row-level security was enabled on the table then this stopped being true.",
      "fixedIn": "12.15",
      "contributor": "Antonin Houska"
    },
    {
      "cve": null,
      "title": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions",
      "description": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions (Tom Lane)",
      "fixedIn": "12.16",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "12.17",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "12.17",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2024-0985",
      "title": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY",
      "description": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY (Heikki Linnakangas)\n          One step of a concurrent refresh command was run under weak security restrictions. If a materialized view's owner could persuade a superuser or other high-privileged user to perform a concurrent refresh on that view, the view's owner could control code executed with the privileges of the user running REFRESH. Fix things so that all user-determined code is run as the view's owner, as expected.\n          The only known exploit for this error does not work in PostgreSQL 16.0 and later, so it may be that v16 is not vulnerable in practice.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2024-0985)",
      "fixedIn": "12.18",
      "contributor": "CVE-2024-0985"
    },
    {
      "cve": null,
      "title": "In pg_dump, don't dump RLS policies or security labels for extension member objects",
      "description": "In pg_dump, don't dump RLS policies or security labels for extension member objects (Tom Lane, Jacob Champion)\n          Previously, commands would be included in the dump to set these properties, which is really incorrect since they should be considered as internal affairs of the extension. Moreover, the restoring user might not have adequate privilege to set them, and indeed the dumping user might not have enough privilege to dump them (since dumping RLS policies requires acquiring lock on their table).",
      "fixedIn": "12.18",
      "contributor": "since dumping RLS policies requires acquiring lock on their table"
    },
    {
      "cve": "CVE-2020-25695",
      "title": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries",
      "description": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries (Noah Misch)\n          This is essentially a leak in the “security restricted operation” sandbox mechanism. An attacker having permission to create non-temporary SQL objects could parlay this leak to execute arbitrary SQL code as a superuser.\n          The PostgreSQL Project thanks Etienne Stalmans for reporting this problem. (CVE-2020-25695)",
      "fixedIn": "12.5",
      "contributor": "CVE-2020-25695"
    },
    {
      "cve": null,
      "title": "Make libpq support arbitrary-length lines in .pgpass files",
      "description": "Make libpq support arbitrary-length lines in .pgpass files (Tom Lane)\n          This is mostly useful to allow using very long security tokens as passwords.",
      "fixedIn": "12.5",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2006-2313",
      "title": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data",
      "description": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data (Tom Lane)\n          An incorrectly-encoded multibyte character near the end of a string could cause various processing loops to run past the string's terminating NUL, with results ranging from no detectable issue to a program crash, depending on what happens to be in the following memory. This is reminiscent of CVE-2006-2313, although these particular cases do not appear to have interesting security consequences.",
      "fixedIn": "12.8",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Ensure that `GetSharedSecurityLabel",
      "description": "Ensure that `GetSharedSecurityLabel()()` can be used in a newly-started session that has not yet built its critical relation cache entries (Jeff Davis)",
      "fixedIn": "12.9",
      "contributor": "Jeff Davis"
    },
    {
      "cve": null,
      "title": "Allow only superusers to view the ssl_passphrase_command setting",
      "description": "Allow only superusers to view the ssl_passphrase_command setting (Insung Moon)\n              This was changed as a security precaution.",
      "fixedIn": "13.0",
      "contributor": "Insung Moon"
    },
    {
      "cve": "CVE-2020-25695",
      "title": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries",
      "description": "Block DECLARE CURSOR ... WITH HOLD and firing of deferred triggers within index expressions and materialized view queries (Noah Misch)\n          This is essentially a leak in the “security restricted operation” sandbox mechanism. An attacker having permission to create non-temporary SQL objects could parlay this leak to execute arbitrary SQL code as a superuser.\n          The PostgreSQL Project thanks Etienne Stalmans for reporting this problem. (CVE-2020-25695)",
      "fixedIn": "13.1",
      "contributor": "CVE-2020-25695"
    },
    {
      "cve": "CVE-2023-2454",
      "title": "Prevent CREATE SCHEMA from defeating changes in search_path",
      "description": "Prevent CREATE SCHEMA from defeating changes in search_path (Alexander Lakhin)\n          Within a CREATE SCHEMA command, objects in the prevailing search_path, as well as those in the newly-created schema, would be visible even within a called function or script that attempted to set a secure search_path. This could allow any user having permission to create a schema to hijack the privileges of a security definer function or extension script.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2023-2454)",
      "fixedIn": "13.11",
      "contributor": "CVE-2023-2454"
    },
    {
      "cve": "CVE-2023-2455",
      "title": "Enforce row-level security policies correctly after inlining a set-returning function",
      "description": "Enforce row-level security policies correctly after inlining a set-returning function (Stephen Frost, Tom Lane)\n          If a set-returning SQL-language function refers to a table having row-level security policies, and it can be inlined into a calling query, those RLS policies would not get enforced properly in some cases involving re-using a cached plan under a different role. This could allow a user to see or modify rows that should have been invisible.\n          The PostgreSQL Project thanks Wolfgang Walther for reporting this problem. (CVE-2023-2455)",
      "fixedIn": "13.11",
      "contributor": "CVE-2023-2455"
    },
    {
      "cve": null,
      "title": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables",
      "description": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables (Antonin Houska)\n          The documentation is quite clear that COPY TO copies rows from only the named table, not any inheritance children it may have. However, if row-level security was enabled on the table then this stopped being true.",
      "fixedIn": "13.11",
      "contributor": "Antonin Houska"
    },
    {
      "cve": null,
      "title": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions",
      "description": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions (Tom Lane)",
      "fixedIn": "13.12",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "13.13",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "13.13",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2024-0985",
      "title": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY",
      "description": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY (Heikki Linnakangas)\n          One step of a concurrent refresh command was run under weak security restrictions. If a materialized view's owner could persuade a superuser or other high-privileged user to perform a concurrent refresh on that view, the view's owner could control code executed with the privileges of the user running REFRESH. Fix things so that all user-determined code is run as the view's owner, as expected.\n          The only known exploit for this error does not work in PostgreSQL 16.0 and later, so it may be that v16 is not vulnerable in practice.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2024-0985)",
      "fixedIn": "13.14",
      "contributor": "CVE-2024-0985"
    },
    {
      "cve": null,
      "title": "In pg_dump, don't dump RLS policies or security labels for extension member objects",
      "description": "In pg_dump, don't dump RLS policies or security labels for extension member objects (Tom Lane, Jacob Champion)\n          Previously, commands would be included in the dump to set these properties, which is really incorrect since they should be considered as internal affairs of the extension. Moreover, the restoring user might not have adequate privilege to set them, and indeed the dumping user might not have enough privilege to dump them (since dumping RLS policies requires acquiring lock on their table).",
      "fixedIn": "13.14",
      "contributor": "since dumping RLS policies requires acquiring lock on their table"
    },
    {
      "cve": "CVE-2021-20229",
      "title": "Fix failure to check per-column `SELECT` privileges in some join queries",
      "description": "Fix failure to check per-column `SELECT` privileges in some join queries (Tom Lane)\n          In some cases involving joins, the parser failed to record all the columns read by a query in the column-usage bitmaps that are used for permissions checking. Although the executor would still insist on some sort of `SELECT` privilege to run the query, this meant that a user having `SELECT` privilege on only one column of a table could nonetheless read all its columns through a suitably crafted query.\n          A stored view that is subject to this problem will have incomplete column-usage bitmaps, and thus permissions will still not be enforced properly on the view after updating. In installations that depend on column-level permissions for security, it is recommended to CREATE OR REPLACE all user-defined views to cause them to be re-parsed.\n          The PostgreSQL Project thanks Sven Klemm for reporting this problem. (CVE-2021-20229)",
      "fixedIn": "13.2",
      "contributor": "CVE-2021-20229"
    },
    {
      "cve": "CVE-2006-2313",
      "title": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data",
      "description": "In psql and other client programs, avoid overrunning the ends of strings when dealing with invalidly-encoded data (Tom Lane)\n          An incorrectly-encoded multibyte character near the end of a string could cause various processing loops to run past the string's terminating NUL, with results ranging from no detectable issue to a program crash, depending on what happens to be in the following memory. This is reminiscent of CVE-2006-2313, although these particular cases do not appear to have interesting security consequences.",
      "fixedIn": "13.4",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Ensure that `GetSharedSecurityLabel",
      "description": "Ensure that `GetSharedSecurityLabel()()` can be used in a newly-started session that has not yet built its critical relation cache entries (Jeff Davis)",
      "fixedIn": "13.5",
      "contributor": "Jeff Davis"
    },
    {
      "cve": "CVE-2022-1552",
      "title": "Confine additional operations within “security restricted operation” sandboxes",
      "description": "Confine additional operations within “security restricted operation” sandboxes (Sergey Shinderuk, Noah Misch)\n          Autovacuum, CLUSTER, CREATE INDEX, REINDEX, REFRESH MATERIALIZED VIEW, and pg_amcheck activated the “security restricted operation” protection mechanism too late, or even not at all in some code paths. A user having permission to create non-temporary objects within a database could define an object that would execute arbitrary SQL code with superuser permissions the next time that autovacuum processed the object, or that some superuser ran one of the affected commands against it.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2022-1552)",
      "fixedIn": "13.7",
      "contributor": "CVE-2022-1552"
    },
    {
      "cve": null,
      "title": "Disallow execution of SPI functions during PL/Perl function compilation",
      "description": "Disallow execution of SPI functions during PL/Perl function compilation (Tom Lane)\n          Perl can be convinced to execute user-defined code during compilation of a PL/Perl function. However, it's not okay for such code to try to invoke SQL operations via SPI. That results in a crash, and if it didn't crash it would be a security hazard, because we really don't want code execution during function validation. Put in a check to give a friendlier error message instead.",
      "fixedIn": "13.7",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Allow SQL-language functions and procedures to use SQL-standard function bodies",
      "description": "Allow SQL-language functions and procedures to use SQL-standard function bodies (Peter Eisentraut)\n            Previously only string-literal function bodies were supported. When writing a function or procedure in SQL-standard syntax, the body is parsed immediately and stored as a parse tree. This allows better tracking of function dependencies, and can have security benefits.",
      "fixedIn": "14.0",
      "contributor": "Peter Eisentraut"
    },
    {
      "cve": null,
      "title": "Mark built-in type coercion functions as leakproof where possible",
      "description": "Mark built-in type coercion functions as leakproof where possible (Tom Lane)\n            This allows more use of functions that require type conversion in security-sensitive situations.",
      "fixedIn": "14.0",
      "contributor": "Tom Lane"
    },
    {
      "cve": null,
      "title": "Ensure that `GetSharedSecurityLabel",
      "description": "Ensure that `GetSharedSecurityLabel()()` can be used in a newly-started session that has not yet built its critical relation cache entries (Jeff Davis)",
      "fixedIn": "14.1",
      "contributor": "Jeff Davis"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "14.10",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "14.10",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2024-0985",
      "title": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY",
      "description": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY (Heikki Linnakangas)\n          One step of a concurrent refresh command was run under weak security restrictions. If a materialized view's owner could persuade a superuser or other high-privileged user to perform a concurrent refresh on that view, the view's owner could control code executed with the privileges of the user running REFRESH. Fix things so that all user-determined code is run as the view's owner, as expected.\n          The only known exploit for this error does not work in PostgreSQL 16.0 and later, so it may be that v16 is not vulnerable in practice.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2024-0985)",
      "fixedIn": "14.11",
      "contributor": "CVE-2024-0985"
    },
    {
      "cve": null,
      "title": "In pg_dump, don't dump RLS policies or security labels for extension member objects",
      "description": "In pg_dump, don't dump RLS policies or security labels for extension member objects (Tom Lane, Jacob Champion)\n          Previously, commands would be included in the dump to set these properties, which is really incorrect since they should be considered as internal affairs of the extension. Moreover, the restoring user might not have adequate privilege to set them, and indeed the dumping user might not have enough privilege to dump them (since dumping RLS policies requires acquiring lock on their table).",
      "fixedIn": "14.11",
      "contributor": "since dumping RLS policies requires acquiring lock on their table"
    },
    {
      "cve": "CVE-2024-4317",
      "title": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner",
      "description": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner (Nathan Bossart)\n          These views failed to hide statistics for expressions that involve columns the accessing user does not have permission to read. View columns such as most_common_vals might expose security-relevant data. The potential interactions here are not fully clear, so in the interest of erring on the side of safety, make rows in these views visible only to the owner of the associated table.\n          The PostgreSQL Project thanks Lukas Fittl for reporting this problem. (CVE-2024-4317)\n          By itself, this fix will only fix the behavior in newly initdb'd database clusters. If you wish to apply this change in an existing cluster, you will need to do the following:\n          \n            \n              \n                Find the SQL script fix-CVE-2024-4317.sql in the `share` directory of the PostgreSQL installation (typically located someplace like /usr/share/postgresql/). Be sure to use the script appropriate to your PostgreSQL major version. If you do not see this file, either your version is not vulnerable (only v14–v16 are affected) or your minor version is too old to have the fix.\n              \n              \n                In each database of the cluster, run the fix-CVE-2024-4317.sql script as superuser. In psql this would look like\n                \\i /usr/share/postgresql/fix-CVE-2024-4317.sql\n\n                (adjust the file path as appropriate). Any error probably indicates that you've used the wrong script version. It will not hurt to run the script more than once.\n              \n              \n                Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n\n              \n            \n          ",
      "fixedIn": "14.12",
      "contributor": "adjust the file path as appropriate"
    },
    {
      "cve": null,
      "title": "Untitled bug",
      "description": "Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n",
      "fixedIn": "14.12",
      "contributor": null
    },
    {
      "cve": "CVE-2022-1552",
      "title": "Confine additional operations within “security restricted operation” sandboxes",
      "description": "Confine additional operations within “security restricted operation” sandboxes (Sergey Shinderuk, Noah Misch)\n          Autovacuum, CLUSTER, CREATE INDEX, REINDEX, REFRESH MATERIALIZED VIEW, and pg_amcheck activated the “security restricted operation” protection mechanism too late, or even not at all in some code paths. A user having permission to create non-temporary objects within a database could define an object that would execute arbitrary SQL code with superuser permissions the next time that autovacuum processed the object, or that some superuser ran one of the affected commands against it.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2022-1552)",
      "fixedIn": "14.3",
      "contributor": "CVE-2022-1552"
    },
    {
      "cve": null,
      "title": "Disallow execution of SPI functions during PL/Perl function compilation",
      "description": "Disallow execution of SPI functions during PL/Perl function compilation (Tom Lane)\n          Perl can be convinced to execute user-defined code during compilation of a PL/Perl function. However, it's not okay for such code to try to invoke SQL operations via SPI. That results in a crash, and if it didn't crash it would be a security hazard, because we really don't want code execution during function validation. Put in a check to give a friendlier error message instead.",
      "fixedIn": "14.3",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-2454",
      "title": "Prevent CREATE SCHEMA from defeating changes in search_path",
      "description": "Prevent CREATE SCHEMA from defeating changes in search_path (Alexander Lakhin)\n          Within a CREATE SCHEMA command, objects in the prevailing search_path, as well as those in the newly-created schema, would be visible even within a called function or script that attempted to set a secure search_path. This could allow any user having permission to create a schema to hijack the privileges of a security definer function or extension script.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2023-2454)",
      "fixedIn": "14.8",
      "contributor": "CVE-2023-2454"
    },
    {
      "cve": "CVE-2023-2455",
      "title": "Enforce row-level security policies correctly after inlining a set-returning function",
      "description": "Enforce row-level security policies correctly after inlining a set-returning function (Stephen Frost, Tom Lane)\n          If a set-returning SQL-language function refers to a table having row-level security policies, and it can be inlined into a calling query, those RLS policies would not get enforced properly in some cases involving re-using a cached plan under a different role. This could allow a user to see or modify rows that should have been invisible.\n          The PostgreSQL Project thanks Wolfgang Walther for reporting this problem. (CVE-2023-2455)",
      "fixedIn": "14.8",
      "contributor": "CVE-2023-2455"
    },
    {
      "cve": null,
      "title": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables",
      "description": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables (Antonin Houska)\n          The documentation is quite clear that COPY TO copies rows from only the named table, not any inheritance children it may have. However, if row-level security was enabled on the table then this stopped being true.",
      "fixedIn": "14.8",
      "contributor": "Antonin Houska"
    },
    {
      "cve": null,
      "title": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions",
      "description": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions (Tom Lane)",
      "fixedIn": "14.9",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2018-1058",
      "title": "Remove `PUBLIC` creation permission on the `public` schema",
      "description": "Remove `PUBLIC` creation permission on the `public` schema (Noah Misch)\n          The new default is one of the secure schema usage patterns that Section&nbsp;5.9.6 has recommended since the security release for CVE-2018-1058. The change applies to new database clusters and to newly-created databases in existing clusters. Upgrading a cluster or restoring a database dump will preserve `public`'s existing permissions.\n          For existing databases, especially those having multiple users, consider revoking `CREATE` permission on the `public` schema to adopt this new default. For new databases having no need to defend against insider threats, granting `CREATE` permission will yield the behavior of prior releases.",
      "fixedIn": "15.0",
      "contributor": "Noah Misch"
    },
    {
      "cve": null,
      "title": "Allow logical replication to run as the owner of the subscription",
      "description": "Allow logical replication to run as the owner of the subscription (Mark Dilger)\n          Because row-level security policies are not checked, only superusers, roles with `bypassrls`, and table owners can replicate into tables with row-level security policies.",
      "fixedIn": "15.0",
      "contributor": "Mark Dilger"
    },
    {
      "cve": null,
      "title": "Make pg_dump dump `public` schema ownership changes and security labels",
      "description": "Make pg_dump dump `public` schema ownership changes and security labels (Noah Misch)",
      "fixedIn": "15.0",
      "contributor": "Noah Misch"
    },
    {
      "cve": "CVE-2023-2454",
      "title": "Prevent CREATE SCHEMA from defeating changes in search_path",
      "description": "Prevent CREATE SCHEMA from defeating changes in search_path (Alexander Lakhin)\n          Within a CREATE SCHEMA command, objects in the prevailing search_path, as well as those in the newly-created schema, would be visible even within a called function or script that attempted to set a secure search_path. This could allow any user having permission to create a schema to hijack the privileges of a security definer function or extension script.\n          The PostgreSQL Project thanks Alexander Lakhin for reporting this problem. (CVE-2023-2454)",
      "fixedIn": "15.3",
      "contributor": "CVE-2023-2454"
    },
    {
      "cve": "CVE-2023-2455",
      "title": "Enforce row-level security policies correctly after inlining a set-returning function",
      "description": "Enforce row-level security policies correctly after inlining a set-returning function (Stephen Frost, Tom Lane)\n          If a set-returning SQL-language function refers to a table having row-level security policies, and it can be inlined into a calling query, those RLS policies would not get enforced properly in some cases involving re-using a cached plan under a different role. This could allow a user to see or modify rows that should have been invisible.\n          The PostgreSQL Project thanks Wolfgang Walther for reporting this problem. (CVE-2023-2455)",
      "fixedIn": "15.3",
      "contributor": "CVE-2023-2455"
    },
    {
      "cve": null,
      "title": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables",
      "description": "Ensure that COPY TO from an RLS-enabled parent table does not copy any rows from child tables (Antonin Houska)\n          The documentation is quite clear that COPY TO copies rows from only the named table, not any inheritance children it may have. However, if row-level security was enabled on the table then this stopped being true.",
      "fixedIn": "15.3",
      "contributor": "Antonin Houska"
    },
    {
      "cve": null,
      "title": "Fix assertion failure for MERGE into a partitioned table with row-level security enabled",
      "description": "Fix assertion failure for MERGE into a partitioned table with row-level security enabled (Dean Rasheed)",
      "fixedIn": "15.3",
      "contributor": "Dean Rasheed"
    },
    {
      "cve": "CVE-2023-39418",
      "title": "Fix MERGE to enforce row security policies properly",
      "description": "Fix MERGE to enforce row security policies properly (Dean Rasheed)\n          When MERGE performs an `UPDATE` action, it should enforce any `UPDATE` or `SELECT` RLS policies defined on the target table, to be consistent with the way that a plain UPDATE with a `WHERE` clause works. Instead it was enforcing `INSERT` RLS policies for both `INSERT` and `UPDATE` actions.\n          In addition, when MERGE performs a `DO NOTHING` action, it applied the target table's `DELETE` RLS policies to existing rows, even though those rows are not being deleted. While it's not a security problem, this could result in unwanted errors.\n          The PostgreSQL Project thanks Dean Rasheed for reporting this problem. (CVE-2023-39418)",
      "fixedIn": "15.4",
      "contributor": "CVE-2023-39418"
    },
    {
      "cve": null,
      "title": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions",
      "description": "Correctly handle sub-SELECTs in RLS policy expressions and security-barrier views when expanding rule actions (Tom Lane)",
      "fixedIn": "15.4",
      "contributor": "Tom Lane"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "15.5",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "15.5",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2024-0985",
      "title": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY",
      "description": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY (Heikki Linnakangas)\n          One step of a concurrent refresh command was run under weak security restrictions. If a materialized view's owner could persuade a superuser or other high-privileged user to perform a concurrent refresh on that view, the view's owner could control code executed with the privileges of the user running REFRESH. Fix things so that all user-determined code is run as the view's owner, as expected.\n          The only known exploit for this error does not work in PostgreSQL 16.0 and later, so it may be that v16 is not vulnerable in practice.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2024-0985)",
      "fixedIn": "15.6",
      "contributor": "CVE-2024-0985"
    },
    {
      "cve": null,
      "title": "In pg_dump, don't dump RLS policies or security labels for extension member objects",
      "description": "In pg_dump, don't dump RLS policies or security labels for extension member objects (Tom Lane, Jacob Champion)\n          Previously, commands would be included in the dump to set these properties, which is really incorrect since they should be considered as internal affairs of the extension. Moreover, the restoring user might not have adequate privilege to set them, and indeed the dumping user might not have enough privilege to dump them (since dumping RLS policies requires acquiring lock on their table).",
      "fixedIn": "15.6",
      "contributor": "since dumping RLS policies requires acquiring lock on their table"
    },
    {
      "cve": "CVE-2024-4317",
      "title": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner",
      "description": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner (Nathan Bossart)\n          These views failed to hide statistics for expressions that involve columns the accessing user does not have permission to read. View columns such as most_common_vals might expose security-relevant data. The potential interactions here are not fully clear, so in the interest of erring on the side of safety, make rows in these views visible only to the owner of the associated table.\n          The PostgreSQL Project thanks Lukas Fittl for reporting this problem. (CVE-2024-4317)\n          By itself, this fix will only fix the behavior in newly initdb'd database clusters. If you wish to apply this change in an existing cluster, you will need to do the following:\n          \n            \n              \n                Find the SQL script fix-CVE-2024-4317.sql in the `share` directory of the PostgreSQL installation (typically located someplace like /usr/share/postgresql/). Be sure to use the script appropriate to your PostgreSQL major version. If you do not see this file, either your version is not vulnerable (only v14–v16 are affected) or your minor version is too old to have the fix.\n              \n              \n                In each database of the cluster, run the fix-CVE-2024-4317.sql script as superuser. In psql this would look like\n                \\i /usr/share/postgresql/fix-CVE-2024-4317.sql\n\n                (adjust the file path as appropriate). Any error probably indicates that you've used the wrong script version. It will not hurt to run the script more than once.\n              \n              \n                Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n\n              \n            \n          ",
      "fixedIn": "15.7",
      "contributor": "adjust the file path as appropriate"
    },
    {
      "cve": null,
      "title": "Untitled bug",
      "description": "Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n",
      "fixedIn": "15.7",
      "contributor": null
    },
    {
      "cve": null,
      "title": "Perform logical replication SELECT and DML actions as the table owner",
      "description": "Perform logical replication SELECT and DML actions as the table owner (Robert Haas)\n            This improves security and now requires subscription owners to be either superusers or to have SET ROLE permission on all roles owning tables in the replication set. The previous behavior of performing all operations as the subscription owner can be enabled with the subscription run_as_owner option.",
      "fixedIn": "16.0",
      "contributor": "Robert Haas"
    },
    {
      "cve": null,
      "title": "Add options to createuser to control more user options",
      "description": "Add options to createuser to control more user options (Shinya Kato)\n            Specifically, the new options control the valid-until date, bypassing of row-level security, and role membership.",
      "fixedIn": "16.0",
      "contributor": "Shinya Kato"
    },
    {
      "cve": "CVE-2023-5869",
      "title": "Detect integer overflow while computing new array dimensions",
      "description": "Detect integer overflow while computing new array dimensions (Tom Lane)\n          When assigning new elements to array subscripts that are outside the current array bounds, an undetected integer overflow could occur in edge cases. Memory stomps that are potentially exploitable for arbitrary code execution are possible, and so is disclosure of server memory.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2023-5869)",
      "fixedIn": "16.1",
      "contributor": "CVE-2023-5869"
    },
    {
      "cve": "CVE-2023-5870",
      "title": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes",
      "description": "Prevent the `pg_signal_backend` role from signalling background workers and autovacuum processes (Noah Misch, Jelte Fennema-Nio)\n          The documentation says that `pg_signal_backend` cannot issue signals to superuser-owned processes. It was able to signal these background processes, though, because they advertise a role OID of zero. Treat that as indicating superuser ownership. The security implications of cancelling one of these process types are fairly small so far as the core code goes (we'll just start another one), but extensions might add background workers that are more vulnerable.\n          Also ensure that the is_superuser parameter is set correctly in such processes. No specific security consequences are known for that oversight, but it might be significant for some extensions.\n          The PostgreSQL Project thanks Hemanth Sandrana and Mahendrakar Srinivasarao for reporting this problem. (CVE-2023-5870)",
      "fixedIn": "16.1",
      "contributor": "CVE-2023-5870"
    },
    {
      "cve": "CVE-2024-0985",
      "title": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY",
      "description": "Tighten security restrictions within REFRESH MATERIALIZED VIEW CONCURRENTLY (Heikki Linnakangas)\n          One step of a concurrent refresh command was run under weak security restrictions. If a materialized view's owner could persuade a superuser or other high-privileged user to perform a concurrent refresh on that view, the view's owner could control code executed with the privileges of the user running REFRESH. Fix things so that all user-determined code is run as the view's owner, as expected.\n          The only known exploit for this error does not work in PostgreSQL 16.0 and later, so it may be that v16 is not vulnerable in practice.\n          The PostgreSQL Project thanks Pedro Gallegos for reporting this problem. (CVE-2024-0985)",
      "fixedIn": "16.2",
      "contributor": "CVE-2024-0985"
    },
    {
      "cve": null,
      "title": "In pg_dump, don't dump RLS policies or security labels for extension member objects",
      "description": "In pg_dump, don't dump RLS policies or security labels for extension member objects (Tom Lane, Jacob Champion)\n          Previously, commands would be included in the dump to set these properties, which is really incorrect since they should be considered as internal affairs of the extension. Moreover, the restoring user might not have adequate privilege to set them, and indeed the dumping user might not have enough privilege to dump them (since dumping RLS policies requires acquiring lock on their table).",
      "fixedIn": "16.2",
      "contributor": "since dumping RLS policies requires acquiring lock on their table"
    },
    {
      "cve": "CVE-2024-4317",
      "title": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner",
      "description": "Restrict visibility of pg_stats_ext and pg_stats_ext_exprs entries to the table owner (Nathan Bossart)\n          These views failed to hide statistics for expressions that involve columns the accessing user does not have permission to read. View columns such as most_common_vals might expose security-relevant data. The potential interactions here are not fully clear, so in the interest of erring on the side of safety, make rows in these views visible only to the owner of the associated table.\n          The PostgreSQL Project thanks Lukas Fittl for reporting this problem. (CVE-2024-4317)\n          By itself, this fix will only fix the behavior in newly initdb'd database clusters. If you wish to apply this change in an existing cluster, you will need to do the following:\n          \n            \n              \n                Find the SQL script fix-CVE-2024-4317.sql in the `share` directory of the PostgreSQL installation (typically located someplace like /usr/share/postgresql/). Be sure to use the script appropriate to your PostgreSQL major version. If you do not see this file, either your version is not vulnerable (only v14–v16 are affected) or your minor version is too old to have the fix.\n              \n              \n                In each database of the cluster, run the fix-CVE-2024-4317.sql script as superuser. In psql this would look like\n                \\i /usr/share/postgresql/fix-CVE-2024-4317.sql\n\n                (adjust the file path as appropriate). Any error probably indicates that you've used the wrong script version. It will not hurt to run the script more than once.\n              \n              \n                Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n\n              \n            \n          ",
      "fixedIn": "16.3",
      "contributor": "adjust the file path as appropriate"
    },
    {
      "cve": null,
      "title": "Untitled bug",
      "description": "Do not forget to include the `template0` and `template1` databases, or the vulnerability will still exist in databases you create later. To fix `template0`, you'll need to temporarily make it accept connections. Do that with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS true;\n\n                and then after fixing `template0`, undo it with\n                ALTER DATABASE template0 WITH ALLOW_CONNECTIONS false;\n",
      "fixedIn": "16.3",
      "contributor": null
    }
  ],
  "features": [
    {
      "title": "Move sequences' metadata fields into a new pg_sequence system catalog",
      "description": "Move sequences' metadata fields into a new pg_sequence system catalog (Peter Eisentraut)\nA sequence relation now stores only the fields that can be modified by `nextval()()`, that is last_value, log_cnt, and is_called. Other sequence properties, such as the starting value and increment, are kept in a corresponding row of the pg_sequence catalog. ALTER SEQUENCE updates are now fully transactional, implying that the sequence is locked until commit. The `nextval()()` and `setval()()` functions remain nontransactional.\nThe main incompatibility introduced by this change is that selecting from a sequence relation now returns only the three fields named above. To obtain the sequence's other properties, applications must look into pg_sequence. The new system view pg_sequences can also be used for this purpose; it provides column names that are more compatible with existing code.\nAlso, sequences created for `SERIAL` columns now generate positive 32-bit wide values, whereas previous versions generated 64-bit wide values. This has no visible effect if the values are only stored in a column.\nThe output of psql's \\d command for a sequence has been redesigned, too.",
      "sinceVersion": "10.0",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Make pg_basebackup stream the WAL needed to restore the backup by default",
      "description": "Make pg_basebackup stream the WAL needed to restore the backup by default (Magnus Hagander)\nThis changes pg_basebackup's -X/--wal-method default to `stream`. An option value `none` has been added to reproduce the old behavior. The pg_basebackup option -x has been removed (instead, use `-X fetch`).",
      "sinceVersion": "10.0",
      "contributor": "instead, use `-X fetch`"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "10.1",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix failure of ALTER TABLE ... ALTER COLUMN TYPE when altering multiple columns' types in one command",
      "description": "Fix failure of ALTER TABLE ... ALTER COLUMN TYPE when altering multiple columns' types in one command (Tom Lane)\nThis fixes a regression introduced in the most recent minor releases: indexes using the altered columns were not processed correctly, leading to strange failures during ALTER TABLE.",
      "sinceVersion": "10.10",
      "contributor": "Tom Lane"
    },
    {
      "title": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION",
      "description": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION (Álvaro Herrera)\npg_dump previously ignored dependencies added this way, causing them to be forgotten during dump/restore or pg_upgrade.",
      "sinceVersion": "10.13",
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Fix slow execution of `ts_headline",
      "description": "Fix slow execution of `ts_headline()()` (Tom Lane)\nThe phrase-search fix added in our previous set of minor releases could cause `ts_headline()()` to take unreasonable amounts of time for long documents; to make matters worse, the query was not cancellable within the troublesome loop.",
      "sinceVersion": "10.14",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time",
      "description": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time (Tom Lane)",
      "sinceVersion": "10.15",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling",
      "description": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling (Tom Lane)\nA newly-listening backend could attempt to read SLRU pages that were in process of being truncated, possibly causing an error.\nThe queue tail pointer could become set to a value that's not equal to the queue position of any backend, resulting in effective disabling of the queue truncation logic. Continued use of NOTIFY then led to queue-fill warnings, and eventually to inability to send any more notifies until the server is restarted.",
      "sinceVersion": "10.16",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists",
      "description": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists (Tom Lane)\nIf the `UPDATE` list contains any multi-column sub-selects (which give rise to junk columns in addition to the results proper), the `UPDATE` path would end up storing tuples that include the values of the extra junk columns. That's fairly harmless in the short run, but if new columns are added to the table then the values would become accessible, possibly leading to malfunctions if they don't match the datatypes of the added columns.\nIn addition, in versions supporting cross-partition updates, a cross-partition update triggered by such a case had the reverse problem: the junk columns were removed from the target list, typically causing an immediate crash due to malfunction of the multi-column sub-select mechanism. (CVE-2021-32028)",
      "sinceVersion": "10.17",
      "contributor": "CVE-2021-32028"
    },
    {
      "title": "Use the CLDR project's data to map Windows time zone names to IANA time zones",
      "description": "Use the CLDR project's data to map Windows time zone names to IANA time zones (Tom Lane)\nWhen running on Windows, initdb attempts to set the new cluster's timezone parameter to the IANA time zone matching the system's prevailing time zone. We were using a mapping table that we'd generated years ago and updated only fitfully; unsurprisingly, it contained a number of errors as well as omissions of recently-added zones. It turns out that CLDR has been tracking the most appropriate mappings, so start using their data. This change will not affect any existing installation, only newly-initialized clusters.",
      "sinceVersion": "10.19",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns",
      "description": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns (Tom Lane)\nThe previous coding could try to read non-returnable columns in addition to the returnable ones. This was fairly harmless because it didn't actually do anything with the bogus values, but it fell foul of a recently-added error check that rejected such a plan.",
      "sinceVersion": "10.21",
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid crash if a table rewrite event trigger is added concurrently with a command that could call such a trigger",
      "description": "Avoid crash if a table rewrite event trigger is added concurrently with a command that could call such a trigger (Álvaro Herrera, Andrew Gierth, Tom Lane)",
      "sinceVersion": "10.4",
      "contributor": "Álvaro Herrera, Andrew Gierth, Tom Lane"
    },
    {
      "title": "By default, panic instead of retrying after `fsync",
      "description": "By default, panic instead of retrying after `fsync()()` failure, to avoid possible data corruption (Craig Ringer, Thomas Munro)\nSome popular operating systems discard kernel data buffers when unable to write them out, reporting this as `fsync()()` failure. If we reissue the `fsync()()` request it will succeed, but in fact the data has been lost, so continuing risks database corruption. By raising a panic condition instead, we can replay from WAL, which may contain the only remaining copy of the data in such a situation. While this is surely ugly and inefficient, there are few alternatives, and fortunately the case happens very rarely.\nA new server parameter data_sync_retry has been added to control this; if you are certain that your kernel does not discard dirty data buffers in such scenarios, you can set data_sync_retry to `on` to restore the old behavior.",
      "sinceVersion": "10.7",
      "contributor": "Craig Ringer, Thomas Munro"
    },
    {
      "title": "Improve initdb's handling of multiple equivalent names for the system time zone",
      "description": "Improve initdb's handling of multiple equivalent names for the system time zone (Tom Lane, Andrew Gierth)\nMake initdb examine the /etc/localtime symbolic link, if that exists, to break ties between equivalent names for the system time zone. This makes initdb more likely to select the time zone name that the user would expect when multiple identical time zones exist. It will not change the behavior if /etc/localtime is not a symlink to a zone data file, nor if the time zone is determined from the TZ environment variable.\nSeparately, prefer `UTC` over other spellings of that time zone, when neither TZ nor /etc/localtime provide a hint. This fixes an annoyance introduced by tzdata 2019a's change to make the `UCT` and `UTC` zone names equivalent: initdb was then preferring `UCT`, which almost nobody wants.",
      "sinceVersion": "10.9",
      "contributor": "Tom Lane, Andrew Gierth"
    },
    {
      "title": "Add all window function framing options specified by SQL:2011",
      "description": "Add all window function framing options specified by SQL:2011 (Oliver Ford, Tom Lane)\n            Specifically, allow `RANGE` mode to use `PRECEDING` and `FOLLOWING` to select rows having grouping values within plus or minus the specified offset. Add `GROUPS` mode to include plus or minus the number of peer groups. Frame exclusion syntax was also added.",
      "sinceVersion": "11.0",
      "contributor": "Oliver Ford, Tom Lane"
    },
    {
      "title": "Add SHA-2 family of hash functions",
      "description": "Add SHA-2 family of hash functions (Peter Eisentraut)\n            Specifically, `sha224()()`, `sha256()()`, `sha384()()`, `sha512()()` were added.",
      "sinceVersion": "11.0",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Fix incorrect expansion of tuples lacking recently-added columns",
      "description": "Fix incorrect expansion of tuples lacking recently-added columns (Andrew Dunstan, Amit Langote)\n          This is known to lead to crashes in triggers on tables with recently-added columns, and could have other symptoms as well.",
      "sinceVersion": "11.1",
      "contributor": "Andrew Dunstan, Amit Langote"
    },
    {
      "title": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time",
      "description": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time (Tom Lane)",
      "sinceVersion": "11.10",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling",
      "description": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling (Tom Lane)\n          A newly-listening backend could attempt to read SLRU pages that were in process of being truncated, possibly causing an error.\n          The queue tail pointer could become set to a value that's not equal to the queue position of any backend, resulting in effective disabling of the queue truncation logic. Continued use of NOTIFY then led to queue-fill warnings, and eventually to inability to send any more notifies until the server is restarted.",
      "sinceVersion": "11.11",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix integer-overflow cases in `substring",
      "description": "Fix integer-overflow cases in `substring()()` functions (Tom Lane, Pavel Stehule)\n          If the specified starting index and length overflow an integer when added together, `substring()()` misbehaved, either throwing a bogus “negative substring length” error for a case that should succeed, or failing to complain that a negative length is negative (and instead returning the whole string, in most cases).",
      "sinceVersion": "11.11",
      "contributor": "and instead returning the whole string, in most cases"
    },
    {
      "title": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists",
      "description": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists (Tom Lane)\n          If the `UPDATE` list contains any multi-column sub-selects (which give rise to junk columns in addition to the results proper), the `UPDATE` path would end up storing tuples that include the values of the extra junk columns. That's fairly harmless in the short run, but if new columns are added to the table then the values would become accessible, possibly leading to malfunctions if they don't match the datatypes of the added columns.\n          In addition, in versions supporting cross-partition updates, a cross-partition update triggered by such a case had the reverse problem: the junk columns were removed from the target list, typically causing an immediate crash due to malfunction of the multi-column sub-select mechanism. (CVE-2021-32028)",
      "sinceVersion": "11.12",
      "contributor": "CVE-2021-32028"
    },
    {
      "title": "Use the CLDR project's data to map Windows time zone names to IANA time zones",
      "description": "Use the CLDR project's data to map Windows time zone names to IANA time zones (Tom Lane)\n          When running on Windows, initdb attempts to set the new cluster's timezone parameter to the IANA time zone matching the system's prevailing time zone. We were using a mapping table that we'd generated years ago and updated only fitfully; unsurprisingly, it contained a number of errors as well as omissions of recently-added zones. It turns out that CLDR has been tracking the most appropriate mappings, so start using their data. This change will not affect any existing installation, only newly-initialized clusters.",
      "sinceVersion": "11.14",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns",
      "description": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns (Tom Lane)\n          The previous coding could try to read non-returnable columns in addition to the returnable ones. This was fairly harmless because it didn't actually do anything with the bogus values, but it fell foul of a recently-added error check that rejected such a plan.",
      "sinceVersion": "11.16",
      "contributor": "Tom Lane"
    },
    {
      "title": "By default, panic instead of retrying after `fsync",
      "description": "By default, panic instead of retrying after `fsync()()` failure, to avoid possible data corruption (Craig Ringer, Thomas Munro)\n          Some popular operating systems discard kernel data buffers when unable to write them out, reporting this as `fsync()()` failure. If we reissue the `fsync()()` request it will succeed, but in fact the data has been lost, so continuing risks database corruption. By raising a panic condition instead, we can replay from WAL, which may contain the only remaining copy of the data in such a situation. While this is surely ugly and inefficient, there are few alternatives, and fortunately the case happens very rarely.\n          A new server parameter data_sync_retry has been added to control this; if you are certain that your kernel does not discard dirty data buffers in such scenarios, you can set data_sync_retry to `on` to restore the old behavior.",
      "sinceVersion": "11.2",
      "contributor": "Craig Ringer, Thomas Munro"
    },
    {
      "title": "Fix possible index corruption when the indexed column has a “fast default”",
      "description": "Fix possible index corruption when the indexed column has a “fast default” (that is, it was added by `ALTER TABLE ADD COLUMN` with a constant non-NULL default value specified, after the table already contained some rows) (Andres Freund)",
      "sinceVersion": "11.2",
      "contributor": "Andres Freund"
    },
    {
      "title": "Make pg_dump include ALTER INDEX SET STATISTICS commands",
      "description": "Make pg_dump include ALTER INDEX SET STATISTICS commands (Michael Paquier)\n          When the ability to attach statistics targets to index expressions was added, we forgot to teach pg_dump about it, so that such settings were lost in dump/reload.",
      "sinceVersion": "11.2",
      "contributor": "Michael Paquier"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "11.20",
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve initdb's handling of multiple equivalent names for the system time zone",
      "description": "Improve initdb's handling of multiple equivalent names for the system time zone (Tom Lane, Andrew Gierth)\n          Make initdb examine the /etc/localtime symbolic link, if that exists, to break ties between equivalent names for the system time zone. This makes initdb more likely to select the time zone name that the user would expect when multiple identical time zones exist. It will not change the behavior if /etc/localtime is not a symlink to a zone data file, nor if the time zone is determined from the TZ environment variable.\n          Separately, prefer `UTC` over other spellings of that time zone, when neither TZ nor /etc/localtime provide a hint. This fixes an annoyance introduced by tzdata 2019a's change to make the `UCT` and `UTC` zone names equivalent: initdb was then preferring `UCT`, which almost nobody wants.",
      "sinceVersion": "11.4",
      "contributor": "Tom Lane, Andrew Gierth"
    },
    {
      "title": "Fix failure of ALTER TABLE ... ALTER COLUMN TYPE when altering multiple columns' types in one command",
      "description": "Fix failure of ALTER TABLE ... ALTER COLUMN TYPE when altering multiple columns' types in one command (Tom Lane)\n          This fixes a regression introduced in the most recent minor releases: indexes using the altered columns were not processed correctly, leading to strange failures during ALTER TABLE.",
      "sinceVersion": "11.5",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix failure to insert default values for “missing” attributes during tuple conversion",
      "description": "Fix failure to insert default values for “missing” attributes during tuple conversion (Vik Fearing, Andrew Gierth)\n          This could result in values incorrectly reading as NULL, when they come from columns that had been added by `ALTER TABLE ADD COLUMN` with a constant default.",
      "sinceVersion": "11.7",
      "contributor": "Vik Fearing, Andrew Gierth"
    },
    {
      "title": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION",
      "description": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION (Álvaro Herrera)\n          pg_dump previously ignored dependencies added this way, causing them to be forgotten during dump/restore or pg_upgrade.",
      "sinceVersion": "11.8",
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Fix slow execution of `ts_headline",
      "description": "Fix slow execution of `ts_headline()()` (Tom Lane)\n          The phrase-search fix added in our previous set of minor releases could cause `ts_headline()()` to take unreasonable amounts of time for long documents; to make matters worse, the query was not cancellable within the troublesome loop.",
      "sinceVersion": "11.9",
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow enumerated values to be added more flexibly",
      "description": "Allow enumerated values to be added more flexibly (Andrew Dunstan, Tom Lane, Thomas Munro)\n            Previously, ALTER TYPE ... ADD VALUE could not be called in a transaction block, unless it was part of the same transaction that created the enumerated type. Now it can be called in a later transaction, so long as the new enumerated value is not referenced until after it is committed.",
      "sinceVersion": "12.0",
      "contributor": "Andrew Dunstan, Tom Lane, Thomas Munro"
    },
    {
      "title": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns",
      "description": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns (Tom Lane)\n          The previous coding could try to read non-returnable columns in addition to the returnable ones. This was fairly harmless because it didn't actually do anything with the bogus values, but it fell foul of a recently-added error check that rejected such a plan.",
      "sinceVersion": "12.11",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION",
      "description": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION (Jehan-Guillaume de Rorthais, Álvaro Herrera)\n          Previously, incorrect or duplicate constraints could be constructed for the newly-added partition.",
      "sinceVersion": "12.13",
      "contributor": "Jehan-Guillaume de Rorthais, Álvaro Herrera"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "12.15",
      "contributor": "Tom Lane"
    },
    {
      "title": "Ensure that index-only scans on name columns return a fully-padded value",
      "description": "Ensure that index-only scans on name columns return a fully-padded value (David Rowley)\n          The value physically stored in the index is truncated, and previously a pointer to that value was returned to callers. This provoked complaints when testing under valgrind. In theory it could result in crashes, though none have been reported.",
      "sinceVersion": "12.19",
      "contributor": "David Rowley"
    },
    {
      "title": "Fix failure in ALTER TABLE when a column referenced in a `GENERATED` expression has been added or changed in type earlier in the same ALTER command",
      "description": "Fix failure in ALTER TABLE when a column referenced in a `GENERATED` expression has been added or changed in type earlier in the same ALTER command (Tom Lane)",
      "sinceVersion": "12.2",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix failure to insert default values for “missing” attributes during tuple conversion",
      "description": "Fix failure to insert default values for “missing” attributes during tuple conversion (Vik Fearing, Andrew Gierth)\n          This could result in values incorrectly reading as NULL, when they come from columns that had been added by `ALTER TABLE ADD COLUMN` with a constant default.",
      "sinceVersion": "12.2",
      "contributor": "Vik Fearing, Andrew Gierth"
    },
    {
      "title": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION",
      "description": "Add pg_dump support for ALTER ... DEPENDS ON EXTENSION (Álvaro Herrera)\n          pg_dump previously ignored dependencies added this way, causing them to be forgotten during dump/restore or pg_upgrade.",
      "sinceVersion": "12.3",
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Ensure that pg_basebackup generates valid tar files",
      "description": "Ensure that pg_basebackup generates valid tar files (Robert Haas)\n          In some cases a partial block of zeroes would be added to the end of the file. While this seems to be harmless with common versions of tar, it's not OK per the POSIX file format spec.",
      "sinceVersion": "12.3",
      "contributor": "Robert Haas"
    },
    {
      "title": "Fix incorrect plan execution when a partitioned table is subject to both static and run-time partition pruning in the same query, and a new partition is added concurrently with the query",
      "description": "Fix incorrect plan execution when a partitioned table is subject to both static and run-time partition pruning in the same query, and a new partition is added concurrently with the query (Amit Langote, Tom Lane)",
      "sinceVersion": "12.4",
      "contributor": "Amit Langote, Tom Lane"
    },
    {
      "title": "Fix slow execution of `ts_headline",
      "description": "Fix slow execution of `ts_headline()()` (Tom Lane)\n          The phrase-search fix added in our previous set of minor releases could cause `ts_headline()()` to take unreasonable amounts of time for long documents; to make matters worse, the query was not cancellable within the troublesome loop.",
      "sinceVersion": "12.4",
      "contributor": "Tom Lane"
    },
    {
      "title": "Handle single `Inf` or `NaN` inputs correctly in floating-point aggregates",
      "description": "Handle single `Inf` or `NaN` inputs correctly in floating-point aggregates (Tom Lane)\n          The affected aggregates are `corr()()`, `covar_pop()()`, `regr_intercept()()`, `regr_r2()()`, `regr_slope()()`, `regr_sxx()()`, `regr_sxy()()`, `regr_syy()()`, `stddev_pop()()`, and `var_pop()()`. The correct answer in such cases is `NaN`, but an algorithmic change introduced in PostgreSQL v12 had caused these aggregates to produce zero instead.",
      "sinceVersion": "12.4",
      "contributor": "Tom Lane"
    },
    {
      "title": "Recheck default partition constraints while routing an inserted or updated tuple to the correct partition",
      "description": "Recheck default partition constraints while routing an inserted or updated tuple to the correct partition (Amit Langote, Álvaro Herrera)\n          This fixes race conditions when partitions are added concurrently with the insertion.",
      "sinceVersion": "12.5",
      "contributor": "Amit Langote, Álvaro Herrera"
    },
    {
      "title": "Avoid failures when a `BEFORE ROW UPDATE` trigger returns the “old” row of a table having dropped or “missing” columns",
      "description": "Avoid failures when a `BEFORE ROW UPDATE` trigger returns the “old” row of a table having dropped or “missing” columns (Amit Langote, Tom Lane)\n          This method of suppressing an update could result in crashes, unexpected `CHECK` constraint failures, or incorrect `RETURNING` output, because “missing” columns would read as NULLs for those purposes. (A column is “missing” for this purpose if it was added by ALTER TABLE ADD COLUMN with a non-NULL, but constant, default value.) Dropped columns could cause trouble as well.",
      "sinceVersion": "12.5",
      "contributor": "A column is “missing” for this purpose if it was added by ALTER TABLE ADD COLUMN with a non-NULL, but constant, default value."
    },
    {
      "title": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time",
      "description": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time (Tom Lane)",
      "sinceVersion": "12.5",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling",
      "description": "Fix recently-introduced race conditions in LISTEN/NOTIFY queue handling (Tom Lane)\n          A newly-listening backend could attempt to read SLRU pages that were in process of being truncated, possibly causing an error.\n          The queue tail pointer could become set to a value that's not equal to the queue position of any backend, resulting in effective disabling of the queue truncation logic. Continued use of NOTIFY then led to queue-fill warnings, and eventually to inability to send any more notifies until the server is restarted.",
      "sinceVersion": "12.6",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix integer-overflow cases in `substring",
      "description": "Fix integer-overflow cases in `substring()()` functions (Tom Lane, Pavel Stehule)\n          If the specified starting index and length overflow an integer when added together, `substring()()` misbehaved, either throwing a bogus “negative substring length” error for a case that should succeed, or failing to complain that a negative length is negative (and instead returning the whole string, in most cases).",
      "sinceVersion": "12.6",
      "contributor": "and instead returning the whole string, in most cases"
    },
    {
      "title": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists",
      "description": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists (Tom Lane)\n          If the `UPDATE` list contains any multi-column sub-selects (which give rise to junk columns in addition to the results proper), the `UPDATE` path would end up storing tuples that include the values of the extra junk columns. That's fairly harmless in the short run, but if new columns are added to the table then the values would become accessible, possibly leading to malfunctions if they don't match the datatypes of the added columns.\n          In addition, in versions supporting cross-partition updates, a cross-partition update triggered by such a case had the reverse problem: the junk columns were removed from the target list, typically causing an immediate crash due to malfunction of the multi-column sub-select mechanism. (CVE-2021-32028)",
      "sinceVersion": "12.7",
      "contributor": "CVE-2021-32028"
    },
    {
      "title": "Fix pg_dump's dumping of generated columns in partitioned tables",
      "description": "Fix pg_dump's dumping of generated columns in partitioned tables (Peter Eisentraut)\n          A fix introduced in the previous minor release should not be applied to partitioned tables, only traditionally-inherited tables.",
      "sinceVersion": "12.7",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Use the CLDR project's data to map Windows time zone names to IANA time zones",
      "description": "Use the CLDR project's data to map Windows time zone names to IANA time zones (Tom Lane)\n          When running on Windows, initdb attempts to set the new cluster's timezone parameter to the IANA time zone matching the system's prevailing time zone. We were using a mapping table that we'd generated years ago and updated only fitfully; unsurprisingly, it contained a number of errors as well as omissions of recently-added zones. It turns out that CLDR has been tracking the most appropriate mappings, so start using their data. This change will not affect any existing installation, only newly-initialized clusters.",
      "sinceVersion": "12.9",
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow partitioned tables to be logically replicated via publications",
      "description": "Allow partitioned tables to be logically replicated via publications (Amit Langote)\n              Previously, partitions had to be replicated individually. Now a partitioned table can be published explicitly, causing all its partitions to be published automatically. Addition/removal of a partition causes it to be likewise added to or removed from the publication. The CREATE PUBLICATION option `publish_via_partition_root` controls whether changes to partitions are published as their own changes or their parent's.",
      "sinceVersion": "13.0",
      "contributor": "Amit Langote"
    },
    {
      "title": "Prevent indexes that use non-default collations from being added as a table's unique or primary key constraint",
      "description": "Prevent indexes that use non-default collations from being added as a table's unique or primary key constraint (Tom Lane)\n              The index's collation must match that of the underlying column, but ALTER TABLE previously failed to check this.",
      "sinceVersion": "13.0",
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid failures when a `BEFORE ROW UPDATE` trigger returns the “old” row of a table having dropped or “missing” columns",
      "description": "Avoid failures when a `BEFORE ROW UPDATE` trigger returns the “old” row of a table having dropped or “missing” columns (Amit Langote, Tom Lane)\n          This method of suppressing an update could result in crashes, unexpected `CHECK` constraint failures, or incorrect `RETURNING` output, because “missing” columns would read as NULLs for those purposes. (A column is “missing” for this purpose if it was added by ALTER TABLE ADD COLUMN with a non-NULL, but constant, default value.) Dropped columns could cause trouble as well.",
      "sinceVersion": "13.1",
      "contributor": "A column is “missing” for this purpose if it was added by ALTER TABLE ADD COLUMN with a non-NULL, but constant, default value."
    },
    {
      "title": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time",
      "description": "Fix recently-added timetz test case so it works when the USA is not observing daylight savings time (Tom Lane)",
      "sinceVersion": "13.1",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "13.11",
      "contributor": "Tom Lane"
    },
    {
      "title": "Ensure that index-only scans on name columns return a fully-padded value",
      "description": "Ensure that index-only scans on name columns return a fully-padded value (David Rowley)\n          The value physically stored in the index is truncated, and previously a pointer to that value was returned to callers. This provoked complaints when testing under valgrind. In theory it could result in crashes, though none have been reported.",
      "sinceVersion": "13.15",
      "contributor": "David Rowley"
    },
    {
      "title": "Fix recently-introduced race condition in LISTEN/NOTIFY queue handling",
      "description": "Fix recently-introduced race condition in LISTEN/NOTIFY queue handling (Tom Lane)\n          A newly-listening backend could attempt to read SLRU pages that were in process of being truncated, possibly causing an error.",
      "sinceVersion": "13.2",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix integer-overflow cases in `substring",
      "description": "Fix integer-overflow cases in `substring()()` functions (Tom Lane, Pavel Stehule)\n          If the specified starting index and length overflow an integer when added together, `substring()()` misbehaved, either throwing a bogus “negative substring length” error for a case that should succeed, or failing to complain that a negative length is negative (and instead returning the whole string, in most cases).",
      "sinceVersion": "13.2",
      "contributor": "and instead returning the whole string, in most cases"
    },
    {
      "title": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists",
      "description": "Fix mishandling of “junk” columns in `INSERT ... ON CONFLICT ... UPDATE` target lists (Tom Lane)\n          If the `UPDATE` list contains any multi-column sub-selects (which give rise to junk columns in addition to the results proper), the `UPDATE` path would end up storing tuples that include the values of the extra junk columns. That's fairly harmless in the short run, but if new columns are added to the table then the values would become accessible, possibly leading to malfunctions if they don't match the datatypes of the added columns.\n          In addition, in versions supporting cross-partition updates, a cross-partition update triggered by such a case had the reverse problem: the junk columns were removed from the target list, typically causing an immediate crash due to malfunction of the multi-column sub-select mechanism. (CVE-2021-32028)",
      "sinceVersion": "13.3",
      "contributor": "CVE-2021-32028"
    },
    {
      "title": "Fix pg_dump's dumping of generated columns in partitioned tables",
      "description": "Fix pg_dump's dumping of generated columns in partitioned tables (Peter Eisentraut)\n          A fix introduced in the previous minor release should not be applied to partitioned tables, only traditionally-inherited tables.",
      "sinceVersion": "13.3",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Ensure that the relation cache is invalidated for all partitions of a partitioned table that is being added to or removed from a publication",
      "description": "Ensure that the relation cache is invalidated for all partitions of a partitioned table that is being added to or removed from a publication (Hou Zhijie, Vignesh C)\n          This oversight could lead to improper replication behavior until all currently-existing sessions have exited.",
      "sinceVersion": "13.5",
      "contributor": "Hou Zhijie, Vignesh C"
    },
    {
      "title": "Use the CLDR project's data to map Windows time zone names to IANA time zones",
      "description": "Use the CLDR project's data to map Windows time zone names to IANA time zones (Tom Lane)\n          When running on Windows, initdb attempts to set the new cluster's timezone parameter to the IANA time zone matching the system's prevailing time zone. We were using a mapping table that we'd generated years ago and updated only fitfully; unsurprisingly, it contained a number of errors as well as omissions of recently-added zones. It turns out that CLDR has been tracking the most appropriate mappings, so start using their data. This change will not affect any existing installation, only newly-initialized clusters.",
      "sinceVersion": "13.5",
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns",
      "description": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns (Tom Lane)\n          The previous coding could try to read non-returnable columns in addition to the returnable ones. This was fairly harmless because it didn't actually do anything with the bogus values, but it fell foul of a recently-added error check that rejected such a plan.",
      "sinceVersion": "13.7",
      "contributor": "Tom Lane"
    },
    {
      "title": "Cope correctly with platforms that have no support for altering the server process's display in ps",
      "description": "Cope correctly with platforms that have no support for altering the server process's display in ps(1) (Andrew Dunstan)\n          Few platforms are like this (the only supported one is Cygwin), so we'd managed not to notice that refactoring introduced a potential memory clobber.",
      "sinceVersion": "13.7",
      "contributor": "the only supported one is Cygwin"
    },
    {
      "title": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION",
      "description": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION (Jehan-Guillaume de Rorthais, Álvaro Herrera)\n          Previously, incorrect or duplicate constraints could be constructed for the newly-added partition.",
      "sinceVersion": "13.9",
      "contributor": "Jehan-Guillaume de Rorthais, Álvaro Herrera"
    },
    {
      "title": "Allow wide tuples to be always added to almost-empty heap pages",
      "description": "Allow wide tuples to be always added to almost-empty heap pages (John Naylor, Floris van Nee)\n            Previously tuples whose insertion would have exceeded the page's fill factor were instead added to new pages.",
      "sinceVersion": "14.0",
      "contributor": "John Naylor, Floris van Nee"
    },
    {
      "title": "Allow `DISTINCT` to be added to `GROUP BY` to remove duplicate `GROUPING SET` combinations",
      "description": "Allow `DISTINCT` to be added to `GROUP BY` to remove duplicate `GROUPING SET` combinations (Vik Fearing)\n            For example, `GROUP BY CUBE (a,b), CUBE (b,c)` will generate duplicate grouping combinations without `DISTINCT`.",
      "sinceVersion": "14.0",
      "contributor": "b,c"
    },
    {
      "title": "Allow REINDEX to change the tablespace of the new index",
      "description": "Allow REINDEX to change the tablespace of the new index (Alexey Kondratov, Michael Paquier, Justin Pryzby)\n            This is done by specifying a `TABLESPACE` clause. A --tablespace option was also added to reindexdb to control this.",
      "sinceVersion": "14.0",
      "contributor": "Alexey Kondratov, Michael Paquier, Justin Pryzby"
    },
    {
      "title": "Allow TRUNCATE to operate on foreign tables",
      "description": "Allow TRUNCATE to operate on foreign tables (Kazutaka Onishi, Kohei KaiGai)\n            The postgres_fdw module also now supports this.",
      "sinceVersion": "14.0",
      "contributor": "Kazutaka Onishi, Kohei KaiGai"
    },
    {
      "title": "Allow publications to be more easily added to and removed from a subscription",
      "description": "Allow publications to be more easily added to and removed from a subscription (Japin Li)\n            The new syntax is ALTER SUBSCRIPTION ... ADD/DROP PUBLICATION. This avoids having to specify all publications to add/remove entries.",
      "sinceVersion": "14.0",
      "contributor": "Japin Li"
    },
    {
      "title": "Provide feature-test macros in libpq-fe.h for recently-added libpq features",
      "description": "Provide feature-test macros in libpq-fe.h for recently-added libpq features (Tom Lane, Álvaro Herrera)\n            Historically, applications have usually used compile-time checks of `PG_VERSION_NUM` to test whether a feature is available. But that's normally the server version, which might not be a good guide to libpq's version. libpq-fe.h now offers `#define` symbols denoting application-visible features added in v14; the intent is to keep adding symbols for such features in future versions.",
      "sinceVersion": "14.0",
      "contributor": "Tom Lane, Álvaro Herrera"
    },
    {
      "title": "Fix incorrect creation of shared dependencies when cloning a database that contains non-builtin objects",
      "description": "Fix incorrect creation of shared dependencies when cloning a database that contains non-builtin objects (Aleksander Alekseev)\n          The effects of this error are probably limited in practice. In principle, it could allow a role to be dropped while it still owns objects; but most installations would never want to drop a role that had been used for objects they'd added to `template1`.",
      "sinceVersion": "14.1",
      "contributor": "Aleksander Alekseev"
    },
    {
      "title": "Use the CLDR project's data to map Windows time zone names to IANA time zones",
      "description": "Use the CLDR project's data to map Windows time zone names to IANA time zones (Tom Lane)\n          When running on Windows, initdb attempts to set the new cluster's timezone parameter to the IANA time zone matching the system's prevailing time zone. We were using a mapping table that we'd generated years ago and updated only fitfully; unsurprisingly, it contained a number of errors as well as omissions of recently-added zones. It turns out that CLDR has been tracking the most appropriate mappings, so start using their data. This change will not affect any existing installation, only newly-initialized clusters.",
      "sinceVersion": "14.1",
      "contributor": "Tom Lane"
    },
    {
      "title": "Ensure that index-only scans on name columns return a fully-padded value",
      "description": "Ensure that index-only scans on name columns return a fully-padded value (David Rowley)\n          The value physically stored in the index is truncated, and previously a pointer to that value was returned to callers. This provoked complaints when testing under valgrind. In theory it could result in crashes, though none have been reported.",
      "sinceVersion": "14.12",
      "contributor": "David Rowley"
    },
    {
      "title": "Fix planner failure when a Result plan node appears immediately underneath an Append node",
      "description": "Fix planner failure when a Result plan node appears immediately underneath an Append node (Etsuro Fujita)\n          Recently-added code to support asynchronous remote queries failed to handle this case, leading to crashes or errors about unrecognized node types.",
      "sinceVersion": "14.3",
      "contributor": "Etsuro Fujita"
    },
    {
      "title": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns",
      "description": "Fix plan generation for index-only scans on indexes with both returnable and non-returnable columns (Tom Lane)\n          The previous coding could try to read non-returnable columns in addition to the returnable ones. This was fairly harmless because it didn't actually do anything with the bogus values, but it fell foul of a recently-added error check that rejected such a plan.",
      "sinceVersion": "14.3",
      "contributor": "Tom Lane"
    },
    {
      "title": "Cope correctly with platforms that have no support for altering the server process's display in ps",
      "description": "Cope correctly with platforms that have no support for altering the server process's display in ps(1) (Andrew Dunstan)\n          Few platforms are like this (the only supported one is Cygwin), so we'd managed not to notice that refactoring introduced a potential memory clobber.",
      "sinceVersion": "14.3",
      "contributor": "the only supported one is Cygwin"
    },
    {
      "title": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION",
      "description": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION (Jehan-Guillaume de Rorthais, Álvaro Herrera)\n          Previously, incorrect or duplicate constraints could be constructed for the newly-added partition.",
      "sinceVersion": "14.6",
      "contributor": "Jehan-Guillaume de Rorthais, Álvaro Herrera"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "14.8",
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow publication of all tables in a schema",
      "description": "Allow publication of all tables in a schema (Vignesh C, Hou Zhijie, Amit Kapila)\n              For example, this syntax is now supported: `CREATE PUBLICATION pub1 FOR TABLES IN SCHEMA s1,s2`. ALTER PUBLICATION supports a similar syntax. Tables added later to the listed schemas will also be replicated.",
      "sinceVersion": "15.0",
      "contributor": "Vignesh C, Hou Zhijie, Amit Kapila"
    },
    {
      "title": "Add support for prepared",
      "description": "Add support for prepared (two-phase) transactions to logical replication (Peter Smith, Ajin Cherian, Amit Kapila, Nikhil Sontakke, Stas Kelvich)\n              The new `CREATE_REPLICATION_SLOT` option is called `TWO_PHASE`. pg_recvlogical now supports a new --two-phase option during slot creation.",
      "sinceVersion": "15.0",
      "contributor": "Peter Smith, Ajin Cherian, Amit Kapila, Nikhil Sontakke, Stas Kelvich"
    },
    {
      "title": "Add regular expression functions for compatibility with other relational systems",
      "description": "Add regular expression functions for compatibility with other relational systems (Gilles Darold, Tom Lane)\n            The new functions are `regexp_count()()`, `regexp_instr()()`, `regexp_like()()`, and `regexp_substr()()`. Some new optional arguments were also added to `regexp_replace()()`.",
      "sinceVersion": "15.0",
      "contributor": "Gilles Darold, Tom Lane"
    },
    {
      "title": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION",
      "description": "Fix construction of per-partition foreign key constraints while doing ALTER TABLE ATTACH PARTITION (Jehan-Guillaume de Rorthais, Álvaro Herrera)\n          Previously, incorrect or duplicate constraints could be constructed for the newly-added partition.",
      "sinceVersion": "15.1",
      "contributor": "Jehan-Guillaume de Rorthais, Álvaro Herrera"
    },
    {
      "title": "Add support for decompiling MERGE commands",
      "description": "Add support for decompiling MERGE commands (Álvaro Herrera)\n          This was overlooked when MERGE was added, but it's essential support for MERGE in new-style SQL functions.",
      "sinceVersion": "15.3",
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Fix corner-case crashes when columns have been added to the end of a view",
      "description": "Fix corner-case crashes when columns have been added to the end of a view (Tom Lane)",
      "sinceVersion": "15.3",
      "contributor": "Tom Lane"
    },
    {
      "title": "Make ALTER TABLE ... ADD COLUMN create identity/serial sequences with the same persistence as their owning tables",
      "description": "Make ALTER TABLE ... ADD COLUMN create identity/serial sequences with the same persistence as their owning tables (Peter Eisentraut)\n          CREATE UNLOGGED TABLE will make any owned sequences be unlogged too. ALTER TABLE missed that consideration, so that an added identity column would have a logged sequence, which seems pointless.",
      "sinceVersion": "15.7",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Ensure that index-only scans on name columns return a fully-padded value",
      "description": "Ensure that index-only scans on name columns return a fully-padded value (David Rowley)\n          The value physically stored in the index is truncated, and previously a pointer to that value was returned to callers. This provoked complaints when testing under valgrind. In theory it could result in crashes, though none have been reported.",
      "sinceVersion": "15.7",
      "contributor": "David Rowley"
    },
    {
      "title": "Remove the server variable vacuum_defer_cleanup_age",
      "description": "Remove the server variable vacuum_defer_cleanup_age (Andres Freund)\n          This has been unnecessary since hot_standby_feedback and replication slots were added.",
      "sinceVersion": "16.0",
      "contributor": "Andres Freund"
    },
    {
      "title": "Role inheritance now controls the default inheritance status of member roles added during GRANT",
      "description": "Role inheritance now controls the default inheritance status of member roles added during GRANT (Robert Haas)\n          The role's default inheritance behavior can be overridden with the new GRANT ... WITH INHERIT clause. This allows inheritance of some roles and not others because the members' inheritance status is set at GRANT time. Previously the inheritance status of member roles was controlled only by the role's inheritance status, and changes to a role's inheritance status affected all previous and future member roles.",
      "sinceVersion": "16.0",
      "contributor": "Robert Haas"
    },
    {
      "title": "Allow parallel application of logical replication",
      "description": "Allow parallel application of logical replication (Hou Zhijie, Wang Wei, Amit Kapila)\n            The CREATE SUBSCRIPTION STREAMING option now supports `parallel` to enable application of large transactions by parallel workers. The number of parallel workers is controlled by the new server variable max_parallel_apply_workers_per_subscription. Wait events `LogicalParallelApplyMain`, `LogicalParallelApplyStateChange`, and `LogicalApplySendData` were also added. Column leader_pid was added to system view pg_stat_subscription to track parallel activity.",
      "sinceVersion": "16.0",
      "contributor": "Hou Zhijie, Wang Wei, Amit Kapila"
    },
    {
      "title": "Deprecate createuser option --role",
      "description": "Deprecate createuser option --role (Nathan Bossart)\n            This option could be easily confused with new createuser role membership options, so option --member-of has been added with the same functionality. The --role option can still be used.",
      "sinceVersion": "16.0",
      "contributor": "Nathan Bossart"
    },
    {
      "title": "Make ALTER TABLE ... ADD COLUMN create identity/serial sequences with the same persistence as their owning tables",
      "description": "Make ALTER TABLE ... ADD COLUMN create identity/serial sequences with the same persistence as their owning tables (Peter Eisentraut)\n          CREATE UNLOGGED TABLE will make any owned sequences be unlogged too. ALTER TABLE missed that consideration, so that an added identity column would have a logged sequence, which seems pointless.",
      "sinceVersion": "16.3",
      "contributor": "Peter Eisentraut"
    },
    {
      "title": "Ensure that index-only scans on name columns return a fully-padded value",
      "description": "Ensure that index-only scans on name columns return a fully-padded value (David Rowley)\n          The value physically stored in the index is truncated, and previously a pointer to that value was returned to callers. This provoked complaints when testing under valgrind. In theory it could result in crashes, though none have been reported.",
      "sinceVersion": "16.3",
      "contributor": "David Rowley"
    },
    {
      "title": "Untitled feature",
      "description": "pg_basebackup now supports incremental backup.",
      "sinceVersion": "17.0",
      "contributor": null
    },
    {
      "title": "Remove server variable old_snapshot_threshold",
      "description": "Remove server variable old_snapshot_threshold (Thomas Munro) §\n          This variable allowed vacuum to remove rows that potentially could be still visible to running transactions, causing \"snapshot too old\" errors later if accessed. This feature might be re-added to PostgreSQL later if an improved implementation is found.",
      "sinceVersion": "17.0",
      "contributor": "Thomas Munro"
    },
    {
      "title": "Create system view pg_stat_checkpointer",
      "description": "Create system view pg_stat_checkpointer (Bharath Rupireddy, Anton A. Melnikov, Alexander Korotkov) § § §\n              Relevant columns have been removed from pg_stat_bgwriter and added to this new system view.",
      "sinceVersion": "17.0",
      "contributor": "Bharath Rupireddy, Anton A. Melnikov, Alexander Korotkov"
    },
    {
      "title": "Allow the use of an ENUM added via ALTER TYPE if the type was created in the same transaction",
      "description": "Allow the use of an ENUM added via ALTER TYPE if the type was created in the same transaction (Tom Lane) §\n            This was previously disallowed.",
      "sinceVersion": "17.0",
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow extensions to define custom wait events",
      "description": "Allow extensions to define custom wait events (Masahiro Ikeda) § § § §\n            Custom wait events have been added to postgres_fdw and dblink.",
      "sinceVersion": "17.0",
      "contributor": "Masahiro Ikeda"
    }
  ],
  "performanceImprovements": [
    {
      "title": "Untitled performance improvement",
      "description": "Significant general performance improvements",
      "sinceVersion": "10.0",
      "significant": true,
      "contributor": null
    },
    {
      "title": "Improve hash index performance",
      "description": "Improve hash index performance (Amit Kapila, Mithun Cy, Ashutosh Sharma)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Amit Kapila, Mithun Cy, Ashutosh Sharma"
    },
    {
      "title": "Allow faster GiST inserts and updates by reusing index space more efficiently",
      "description": "Allow faster GiST inserts and updates by reusing index space more efficiently (Andrey Borodin)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Andrey Borodin"
    },
    {
      "title": "Improve performance of queries affected by row-level security restrictions",
      "description": "Improve performance of queries affected by row-level security restrictions (Tom Lane)\nThe optimizer now has more knowledge about where it can place RLS filter conditions, allowing better plans to be generated while still enforcing the RLS conditions safely.",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Speed up aggregate functions that calculate a running sum using numeric-type arithmetic, including some variants of `SUM",
      "description": "Speed up aggregate functions that calculate a running sum using numeric-type arithmetic, including some variants of `SUM()()`, `AVG()()`, and `STDDEV()()` (Heikki Linnakangas)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Heikki Linnakangas"
    },
    {
      "title": "Improve performance of character encoding conversions by using radix trees",
      "description": "Improve performance of character encoding conversions by using radix trees (Kyotaro Horiguchi, Heikki Linnakangas)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Kyotaro Horiguchi, Heikki Linnakangas"
    },
    {
      "title": "Improve sort performance of the macaddr data type",
      "description": "Improve sort performance of the macaddr data type (Brandur Leach)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Brandur Leach"
    },
    {
      "title": "Improve performance of hot standby replay with better tracking of Access Exclusive locks",
      "description": "Improve performance of hot standby replay with better tracking of Access Exclusive locks (Simon Riggs, David Rowley)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Simon Riggs, David Rowley"
    },
    {
      "title": "Speed up two-phase commit recovery performance",
      "description": "Speed up two-phase commit recovery performance (Stas Kelvich, Nikhil Sontakke, Michael Paquier)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Stas Kelvich, Nikhil Sontakke, Michael Paquier"
    },
    {
      "title": "Improve speed of VACUUM's removal of trailing empty heap pages",
      "description": "Improve speed of VACUUM's removal of trailing empty heap pages (Claudio Freire, Álvaro Herrera)",
      "sinceVersion": "10.0",
      "significant": false,
      "contributor": "Claudio Freire, Álvaro Herrera"
    },
    {
      "title": "Prevent sharing transition states between ordered-set aggregates",
      "description": "Prevent sharing transition states between ordered-set aggregates (David Rowley)\nThis causes a crash with the built-in ordered-set aggregates, and probably with user-written ones as well. v11 and later will include provisions for dealing with such cases safely, but in released branches, just disable the optimization.",
      "sinceVersion": "10.1",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Reduce the frequency of data flush requests during bulk file copies to avoid performance problems on macOS, particularly with its new APFS file system",
      "description": "Reduce the frequency of data flush requests during bulk file copies to avoid performance problems on macOS, particularly with its new APFS file system (Tom Lane)",
      "sinceVersion": "10.1",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid an unnecessary catalog lookup during heap page pruning",
      "description": "Avoid an unnecessary catalog lookup during heap page pruning (Thomas Munro)\nIt's no longer necessary to check for unlogged indexes here, and the check caused significant performance problems in some workloads. There was also at least a theoretical possibility of deadlock.",
      "sinceVersion": "10.11",
      "significant": true,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Fix contrib/intarray's GiST opclasses to not fail for empty arrays with `&lt;@`",
      "description": "Fix contrib/intarray's GiST opclasses to not fail for empty arrays with `&lt;@` (Tom Lane)\nA clause like ``array_column` &lt;@ constant_array` is considered indexable, but the index search may not find empty array values; of course, such entries should trivially match the search.\nThe only practical back-patchable fix for this requires making `&lt;@` index searches scan the whole index, which is what this patch does. This is unfortunate: it means that the query performance is likely worse than a plain sequential scan would be.\nApplications whose performance is adversely impacted by this change have a couple of options. They could switch to a GIN index, which doesn't have this bug, or they could replace ``array_column` &lt;@ constant_array` with ``array_column` &lt;@ constant_array` AND `array_column` &amp;&amp; `constant_array`. That will provide about the same performance as before, and it will find all non-empty subsets of the given constant array, which is all that could reliably be expected of the query before.",
      "sinceVersion": "10.11",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve performance of hash joins with very large inner relations",
      "description": "Improve performance of hash joins with very large inner relations (Thomas Munro)",
      "sinceVersion": "10.12",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message",
      "description": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message (Álvaro Herrera)\nThis is a relatively minor problem when using built-in logical replication, because the built-in walreceiver will send a feedback reply (which clears the incorrect state) fairly frequently anyway. But with some other replication systems, such as pglogical, it causes significant performance issues.",
      "sinceVersion": "10.14",
      "significant": true,
      "contributor": "which clears the incorrect state"
    },
    {
      "title": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns",
      "description": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns (Tom Lane)\nA “constant” subquery output column isn't really constant if it is a grouping column that appears in only some of the grouping sets.",
      "sinceVersion": "10.15",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "In libpq for Windows, call `WSAStartup",
      "description": "In libpq for Windows, call `WSAStartup()()` once per process and `WSACleanup()()` not at all (Tom Lane, Alexander Lakhin)\nPreviously, libpq invoked `WSAStartup()()` at connection start and `WSACleanup()()` at connection cleanup. However, it appears that calling `WSACleanup()()` can interfere with other program operations; notably, we have observed rare failures to emit expected output to stdout. There appear to be no ill effects from omitting the call, so do that. (This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections.)",
      "sinceVersion": "10.15",
      "significant": false,
      "contributor": "This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections."
    },
    {
      "title": "Make pg_upgrade carry forward the old installation's `oldestXID` value",
      "description": "Make pg_upgrade carry forward the old installation's `oldestXID` value (Bertrand Drouvot)\nPreviously, the new installation's `oldestXID` was set to a value old enough to (usually) force immediate anti-wraparound autovacuuming. That's not desirable from a performance standpoint; what's worse, installations using large values of autovacuum_freeze_max_age could suffer unwanted forced shutdowns soon after an upgrade.",
      "sinceVersion": "10.18",
      "significant": false,
      "contributor": "usually"
    },
    {
      "title": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal`",
      "description": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal` (Noah Misch)\nIf the server crashed between CREATE TABLESPACE and the next checkpoint, replay would fully remove the contents of the new tablespace's directory, relying on subsequent WAL replay to restore everything within that directory. This interacts badly with optimizations that skip writing WAL (one example is COPY into a just-created table). Such optimizations are applied only when wal_level is `minimal`, which is not the default in v10 and later.",
      "sinceVersion": "10.19",
      "significant": false,
      "contributor": "one example is COPY into a just-created table"
    },
    {
      "title": "Fix regular expression performance bug with back-references inside iteration nodes",
      "description": "Fix regular expression performance bug with back-references inside iteration nodes (Tom Lane)\nIncorrect back-tracking logic could result in exponential time spent looking for a match. Fortunately the problem is masked in most cases by other optimizations.",
      "sinceVersion": "10.19",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent wraparound of overflowed-subtransaction tracking on standby servers",
      "description": "Prevent wraparound of overflowed-subtransaction tracking on standby servers (Kyotaro Horiguchi, Alexander Korotkov)\nThis oversight could cause significant performance degradation (manifesting as excessive SubtransSLRU traffic) on standby servers.",
      "sinceVersion": "10.19",
      "significant": true,
      "contributor": "manifesting as excessive SubtransSLRU traffic"
    },
    {
      "title": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type",
      "description": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type()()` (Tom Lane)\nThese changes provide only marginal improvement when dumping from a local server, but a dump from a remote server can benefit substantially due to fewer network round-trips.",
      "sinceVersion": "10.19",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Add spinlock support for the RISC-V architecture",
      "description": "Add spinlock support for the RISC-V architecture (Marek Szuba)\nThis is essential for reasonable performance on that platform.",
      "sinceVersion": "10.19",
      "significant": false,
      "contributor": "Marek Szuba"
    },
    {
      "title": "Provide for forward compatibility with future minor protocol versions",
      "description": "Provide for forward compatibility with future minor protocol versions (Robert Haas, Badrul Chowdhury)\nUp to now, PostgreSQL servers simply rejected requests to use protocol versions newer than 3.0, so that there was no functional difference between the major and minor parts of the protocol version number. Allow clients to request versions 3.x without failing, sending back a message showing that the server only understands 3.0. This makes no difference at the moment, but back-patching this change should allow speedier introduction of future minor protocol upgrades.",
      "sinceVersion": "10.2",
      "significant": true,
      "contributor": "Robert Haas, Badrul Chowdhury"
    },
    {
      "title": "In ecpglib, avoid redundant `newlocale",
      "description": "In ecpglib, avoid redundant `newlocale()()` calls (Noah Misch)\nAllocate a C locale object once per process when first connecting, rather than creating and freeing locale objects once per query. This mitigates a libc memory leak on AIX, and may offer some performance benefit everywhere.",
      "sinceVersion": "10.22",
      "significant": false,
      "contributor": "Noah Misch"
    },
    {
      "title": "In Snowball dictionaries, don't try to stem excessively-long words",
      "description": "In Snowball dictionaries, don't try to stem excessively-long words (Olly Betts, Tom Lane)\nIf the input word exceeds 1000 bytes, return it as-is after case folding, rather than trying to run it through the Snowball code. This restriction protects against a known recursion-to-stack-overflow problem in the Turkish stemmer, and it seems like good insurance against any other safety or performance issues that may exist in the Snowball stemmers. Such a long string is surely not a word in any human language, so it's doubtful that the stemmer would have done anything desirable with it anyway.",
      "sinceVersion": "10.23",
      "significant": false,
      "contributor": "Olly Betts, Tom Lane"
    },
    {
      "title": "Fix incorrect volatility markings on a few built-in functions",
      "description": "Fix incorrect volatility markings on a few built-in functions (Thomas Munro, Tom Lane)\nThe functions `query_to_xml()`, `cursor_to_xml()`, `cursor_to_xmlschema()`, `query_to_xmlschema()`, and `query_to_xml_and_xmlschema()` should be marked volatile because they execute user-supplied queries that might contain volatile operations. They were not, leading to a risk of incorrect query optimization. This has been repaired for new installations by correcting the initial catalog data, but existing installations will continue to contain the incorrect markings. Practical use of these functions seems to pose little hazard, but in case of trouble, it can be fixed by manually updating these functions' pg_proc entries, for example `ALTER FUNCTION pg_catalog.query_to_xml(text, boolean, boolean, text) VOLATILE`. (Note that that will need to be done in each database of the installation.) Another option is to pg_upgrade the database to a version containing the corrected initial data.",
      "sinceVersion": "10.4",
      "significant": false,
      "contributor": "Note that that will need to be done in each database of the installation."
    },
    {
      "title": "Fix misoptimization of `CHECK` constraints having provably-NULL subclauses of top-level `AND`/`OR` conditions",
      "description": "Fix misoptimization of `CHECK` constraints having provably-NULL subclauses of top-level `AND`/`OR` conditions (Tom Lane, Dean Rasheed)\nThis could, for example, allow constraint exclusion to exclude a child table that should not be excluded from a query.",
      "sinceVersion": "10.4",
      "significant": false,
      "contributor": "Tom Lane, Dean Rasheed"
    },
    {
      "title": "Improve performance of WAL replay for transactions that drop many relations",
      "description": "Improve performance of WAL replay for transactions that drop many relations (Fujii Masao)\nThis change reduces the number of times that shared buffers are scanned, so that it is of most benefit when that setting is large.",
      "sinceVersion": "10.5",
      "significant": false,
      "contributor": "Fujii Masao"
    },
    {
      "title": "Improve performance of lock releasing in standby server WAL replay",
      "description": "Improve performance of lock releasing in standby server WAL replay (Thomas Munro)",
      "sinceVersion": "10.5",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Pad arrays of unnamed POSIX semaphores to reduce cache line sharing",
      "description": "Pad arrays of unnamed POSIX semaphores to reduce cache line sharing (Thomas Munro)\nThis reduces contention on many-CPU systems, fixing a performance regression (compared to previous releases) on Linux and FreeBSD.",
      "sinceVersion": "10.5",
      "significant": false,
      "contributor": "compared to previous releases"
    },
    {
      "title": "Fix hash-join costing mistake introduced with inner_unique optimization",
      "description": "Fix hash-join costing mistake introduced with inner_unique optimization (David Rowley)\nThis could lead to bad plan choices in situations where that optimization was applicable.",
      "sinceVersion": "10.5",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix misoptimization of equivalence classes involving composite-type columns",
      "description": "Fix misoptimization of equivalence classes involving composite-type columns (Tom Lane)\nThis resulted in failure to recognize that an index on a composite column could provide the sort order needed for a mergejoin on that column.",
      "sinceVersion": "10.5",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Update the free space map during WAL replay of page all-visible/frozen flag changes",
      "description": "Update the free space map during WAL replay of page all-visible/frozen flag changes (Álvaro Herrera)\nPreviously we were not careful about this, reasoning that the FSM is not critical data anyway. However, if it's sufficiently out of date, that can result in significant performance degradation after a standby has been promoted to primary. The FSM will eventually be healed by updates, but we'd like it to be good sooner, so work harder at maintaining it during WAL replay.",
      "sinceVersion": "10.6",
      "significant": true,
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Avoid using potentially-under-aligned page buffers",
      "description": "Avoid using potentially-under-aligned page buffers (Tom Lane)\nInvent new union types PGAlignedBlock and PGAlignedXLogBlock, and use these in place of plain char arrays, ensuring that the compiler can't place the buffer at a misaligned start address. This fixes potential core dumps on alignment-picky platforms, and may improve performance even on platforms that allow misalignment.",
      "sinceVersion": "10.6",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid deadlock between GIN vacuuming and concurrent index insertions",
      "description": "Avoid deadlock between GIN vacuuming and concurrent index insertions (Alexander Korotkov, Andrey Borodin, Peter Geoghegan)\nThis change partially reverts a performance improvement, introduced in version 10.0, that attempted to reduce the number of index pages locked during deletion of a GIN posting tree page. That's now been found to lead to deadlocks, so we've removed it pending closer analysis.",
      "sinceVersion": "10.7",
      "significant": false,
      "contributor": "Alexander Korotkov, Andrey Borodin, Peter Geoghegan"
    },
    {
      "title": "Prevent incorrect use of WAL-skipping optimization during COPY to a view or foreign table",
      "description": "Prevent incorrect use of WAL-skipping optimization during COPY to a view or foreign table (Amit Langote, Michael Paquier)",
      "sinceVersion": "10.7",
      "significant": false,
      "contributor": "Amit Langote, Michael Paquier"
    },
    {
      "title": "Speed up planning when there are many equality conditions and many potentially-relevant foreign key constraints",
      "description": "Speed up planning when there are many equality conditions and many potentially-relevant foreign key constraints (David Rowley)",
      "sinceVersion": "10.8",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Avoid O",
      "description": "Avoid O(N^2) performance issue when rolling back a transaction that created many tables (Tomas Vondra)",
      "sinceVersion": "10.8",
      "significant": false,
      "contributor": "Tomas Vondra"
    },
    {
      "title": "Fix misoptimization of `{1,1}` quantifiers in regular expressions",
      "description": "Fix misoptimization of `{1,1}` quantifiers in regular expressions (Tom Lane)\nSuch quantifiers were treated as no-ops and optimized away; but the documentation specifies that they impose greediness, or non-greediness in the case of the non-greedy variant `{1,1}?`, on the subexpression they're attached to, and this did not happen. The misbehavior occurred only if the subexpression contained capturing parentheses or a back-reference.",
      "sinceVersion": "10.9",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Improvements to partitioning functionality, including:\n          \n            \n              \n                Add support for partitioning by a hash key\n              \n              \n                Add support for `PRIMARY KEY`, `FOREIGN KEY`, indexes, and triggers on partitioned tables\n              \n              \n                Allow creation of a “default” partition for storing data that does not match any of the remaining partitions\n              \n              \n                UPDATE statements that change a partition key column now cause affected rows to be moved to the appropriate partitions\n              \n              \n                Improve SELECT performance through enhanced partition elimination strategies during query planning and execution\n              \n            \n          ",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Untitled performance improvement",
      "description": "Improve SELECT performance through enhanced partition elimination strategies during query planning and execution",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Optional Just-in-Time",
      "description": "Optional Just-in-Time (JIT) compilation for some SQL code, speeding evaluation of expressions",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "JIT"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Many other useful performance improvements, including the ability to avoid a table rewrite for ALTER TABLE ... ADD COLUMN with a non-null column default",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Allow faster partition elimination during query processing",
      "description": "Allow faster partition elimination during query processing (Amit Langote, David Rowley, Dilip Kumar)\n              This speeds access to partitioned tables with many partitions.",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Amit Langote, David Rowley, Dilip Kumar"
    },
    {
      "title": "Improve performance of sequential scans with many parallel workers",
      "description": "Improve performance of sequential scans with many parallel workers (David Rowley)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve performance of monotonically increasing index additions",
      "description": "Improve performance of monotonically increasing index additions (Pavan Deolasee, Peter Geoghegan)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Pavan Deolasee, Peter Geoghegan"
    },
    {
      "title": "Improve performance of hash index scans",
      "description": "Improve performance of hash index scans (Ashutosh Sharma)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Ashutosh Sharma"
    },
    {
      "title": "Add Just-in-Time",
      "description": "Add Just-in-Time (JIT) compilation of some parts of query plans to improve execution speed (Andres Freund)\n              This feature requires LLVM to be available. It is not currently enabled by default, even in builds that support it.",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Improve performance of committing multiple concurrent transactions",
      "description": "Improve performance of committing multiple concurrent transactions (Amit Kapila)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Amit Kapila"
    },
    {
      "title": "Improve the speed of aggregate computations",
      "description": "Improve the speed of aggregate computations (Andres Freund)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Speed up lookups of built-in functions by OID",
      "description": "Speed up lookups of built-in functions by OID (Andres Freund)\n            The previous binary search has been replaced by a lookup array.",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Speed up construction of query results",
      "description": "Speed up construction of query results (Andres Freund)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Improve speed of access to system caches",
      "description": "Improve speed of access to system caches (Andres Freund)",
      "sinceVersion": "11.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Disable recheck_on_update optimization",
      "description": "Disable recheck_on_update optimization (Tom Lane)\n          This new-in-v11 feature turns out not to have been ready for prime time. Disable it until something can be done about it.",
      "sinceVersion": "11.1",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns",
      "description": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns (Tom Lane)\n          A “constant” subquery output column isn't really constant if it is a grouping column that appears in only some of the grouping sets.",
      "sinceVersion": "11.10",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "In libpq for Windows, call `WSAStartup",
      "description": "In libpq for Windows, call `WSAStartup()()` once per process and `WSACleanup()()` not at all (Tom Lane, Alexander Lakhin)\n          Previously, libpq invoked `WSAStartup()()` at connection start and `WSACleanup()()` at connection cleanup. However, it appears that calling `WSACleanup()()` can interfere with other program operations; notably, we have observed rare failures to emit expected output to stdout. There appear to be no ill effects from omitting the call, so do that. (This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections.)",
      "sinceVersion": "11.10",
      "significant": false,
      "contributor": "This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections."
    },
    {
      "title": "Avoid `memcpy",
      "description": "Avoid `memcpy()()` with a NULL source pointer and zero count during partitioned index creation (Álvaro Herrera)\n          While such a call is not known to cause problems in itself, some compilers assume that the arguments of `memcpy()()` are never NULL, which could result in incorrect optimization of nearby code.",
      "sinceVersion": "11.11",
      "significant": false,
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Make pg_upgrade carry forward the old installation's `oldestXID` value",
      "description": "Make pg_upgrade carry forward the old installation's `oldestXID` value (Bertrand Drouvot)\n          Previously, the new installation's `oldestXID` was set to a value old enough to (usually) force immediate anti-wraparound autovacuuming. That's not desirable from a performance standpoint; what's worse, installations using large values of autovacuum_freeze_max_age could suffer unwanted forced shutdowns soon after an upgrade.",
      "sinceVersion": "11.13",
      "significant": false,
      "contributor": "usually"
    },
    {
      "title": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal`",
      "description": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal` (Noah Misch)\n          If the server crashed between CREATE TABLESPACE and the next checkpoint, replay would fully remove the contents of the new tablespace's directory, relying on subsequent WAL replay to restore everything within that directory. This interacts badly with optimizations that skip writing WAL (one example is COPY into a just-created table). Such optimizations are applied only when wal_level is `minimal`, which is not the default in v10 and later.",
      "sinceVersion": "11.14",
      "significant": false,
      "contributor": "one example is COPY into a just-created table"
    },
    {
      "title": "Fix regular expression performance bug with back-references inside iteration nodes",
      "description": "Fix regular expression performance bug with back-references inside iteration nodes (Tom Lane)\n          Incorrect back-tracking logic could result in exponential time spent looking for a match. Fortunately the problem is masked in most cases by other optimizations.",
      "sinceVersion": "11.14",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent wraparound of overflowed-subtransaction tracking on standby servers",
      "description": "Prevent wraparound of overflowed-subtransaction tracking on standby servers (Kyotaro Horiguchi, Alexander Korotkov)\n          This oversight could cause significant performance degradation (manifesting as excessive SubtransSLRU traffic) on standby servers.",
      "sinceVersion": "11.14",
      "significant": true,
      "contributor": "manifesting as excessive SubtransSLRU traffic"
    },
    {
      "title": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type",
      "description": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type()()` (Tom Lane)\n          These changes provide only marginal improvement when dumping from a local server, but a dump from a remote server can benefit substantially due to fewer network round-trips.",
      "sinceVersion": "11.14",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Add spinlock support for the RISC-V architecture",
      "description": "Add spinlock support for the RISC-V architecture (Marek Szuba)\n          This is essential for reasonable performance on that platform.",
      "sinceVersion": "11.14",
      "significant": false,
      "contributor": "Marek Szuba"
    },
    {
      "title": "In ecpglib, avoid redundant `newlocale",
      "description": "In ecpglib, avoid redundant `newlocale()()` calls (Noah Misch)\n          Allocate a C locale object once per process when first connecting, rather than creating and freeing locale objects once per query. This mitigates a libc memory leak on AIX, and may offer some performance benefit everywhere.",
      "sinceVersion": "11.17",
      "significant": false,
      "contributor": "Noah Misch"
    },
    {
      "title": "In Snowball dictionaries, don't try to stem excessively-long words",
      "description": "In Snowball dictionaries, don't try to stem excessively-long words (Olly Betts, Tom Lane)\n          If the input word exceeds 1000 bytes, return it as-is after case folding, rather than trying to run it through the Snowball code. This restriction protects against a known recursion-to-stack-overflow problem in the Turkish stemmer, and it seems like good insurance against any other safety or performance issues that may exist in the Snowball stemmers. Such a long string is surely not a word in any human language, so it's doubtful that the stemmer would have done anything desirable with it anyway.",
      "sinceVersion": "11.18",
      "significant": false,
      "contributor": "Olly Betts, Tom Lane"
    },
    {
      "title": "Honor non-default settings of checkpoint_completion_target",
      "description": "Honor non-default settings of checkpoint_completion_target (Bharath Rupireddy)\n          Internal state was not updated after a change in checkpoint_completion_target, possibly resulting in performing checkpoint I/O faster or slower than desired, especially if that setting was changed on-the-fly.",
      "sinceVersion": "11.19",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Limit the amount of cleanup work done by `get_actual_variable_range",
      "description": "Limit the amount of cleanup work done by `get_actual_variable_range()` (Simon Riggs)\n          Planner runs occurring just after deletion of a large number of tuples appearing at the end of an index could expend significant amounts of work setting the “killed” bits for those index entries. Limit the amount of work done in any one query by giving up on this process after examining 100 heap pages. All the cleanup will still happen eventually, but without so large a performance hiccup.",
      "sinceVersion": "11.19",
      "significant": true,
      "contributor": "Simon Riggs"
    },
    {
      "title": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary",
      "description": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary (Simon Riggs, Michail Nikolaev)\n          Insufficiently-aggressive cleanup of the KnownAssignedXids array could lead to poor performance, particularly when max_connections is set to a large value on the standby.",
      "sinceVersion": "11.19",
      "significant": false,
      "contributor": "Simon Riggs, Michail Nikolaev"
    },
    {
      "title": "Avoid deadlock between GIN vacuuming and concurrent index insertions",
      "description": "Avoid deadlock between GIN vacuuming and concurrent index insertions (Alexander Korotkov, Andrey Borodin, Peter Geoghegan)\n          This change partially reverts a performance improvement, introduced in version 10.0, that attempted to reduce the number of index pages locked during deletion of a GIN posting tree page. That's now been found to lead to deadlocks, so we've removed it pending closer analysis.",
      "sinceVersion": "11.2",
      "significant": false,
      "contributor": "Alexander Korotkov, Andrey Borodin, Peter Geoghegan"
    },
    {
      "title": "Prevent incorrect use of WAL-skipping optimization during COPY to a view or foreign table",
      "description": "Prevent incorrect use of WAL-skipping optimization during COPY to a view or foreign table (Amit Langote, Michael Paquier)",
      "sinceVersion": "11.2",
      "significant": false,
      "contributor": "Amit Langote, Michael Paquier"
    },
    {
      "title": "Fix performance and memory leakage issues in hash-based grouping",
      "description": "Fix performance and memory leakage issues in hash-based grouping (Andres Freund)",
      "sinceVersion": "11.2",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Improve planning speed for large inheritance or partitioning table groups",
      "description": "Improve planning speed for large inheritance or partitioning table groups (Amit Langote, Etsuro Fujita)",
      "sinceVersion": "11.2",
      "significant": false,
      "contributor": "Amit Langote, Etsuro Fujita"
    },
    {
      "title": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs",
      "description": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs (David Rowley)\n          This optimization requires that the aggregate's argument expressions have repeatable results, which might not hold for a sub-SELECT.",
      "sinceVersion": "11.20",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix glitches in `SERIALIZABLE READ ONLY` optimization",
      "description": "Fix glitches in `SERIALIZABLE READ ONLY` optimization (Thomas Munro)\n          Transactions already marked as “doomed” confused the safe-snapshot optimization for `SERIALIZABLE READ ONLY` transactions. The optimization was unnecessarily skipped in some cases. In other cases an assertion failure occurred (but there was no problem in non-assert builds).",
      "sinceVersion": "11.20",
      "significant": false,
      "contributor": "but there was no problem in non-assert builds"
    },
    {
      "title": "Speed up planning when there are many equality conditions and many potentially-relevant foreign key constraints",
      "description": "Speed up planning when there are many equality conditions and many potentially-relevant foreign key constraints (David Rowley)",
      "sinceVersion": "11.3",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Avoid O",
      "description": "Avoid O(N^2) performance issue when rolling back a transaction that created many tables (Tomas Vondra)",
      "sinceVersion": "11.3",
      "significant": false,
      "contributor": "Tomas Vondra"
    },
    {
      "title": "Fix misoptimization of `{1,1}` quantifiers in regular expressions",
      "description": "Fix misoptimization of `{1,1}` quantifiers in regular expressions (Tom Lane)\n          Such quantifiers were treated as no-ops and optimized away; but the documentation specifies that they impose greediness, or non-greediness in the case of the non-greedy variant `{1,1}?`, on the subexpression they're attached to, and this did not happen. The misbehavior occurred only if the subexpression contained capturing parentheses or a back-reference.",
      "sinceVersion": "11.4",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid an unnecessary catalog lookup during heap page pruning",
      "description": "Avoid an unnecessary catalog lookup during heap page pruning (Thomas Munro)\n          It's no longer necessary to check for unlogged indexes here, and the check caused significant performance problems in some workloads. There was also at least a theoretical possibility of deadlock.",
      "sinceVersion": "11.6",
      "significant": true,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Fix failure to JIT-compile equality comparisons for grouping hash tables, leading to performance loss",
      "description": "Fix failure to JIT-compile equality comparisons for grouping hash tables, leading to performance loss (Andres Freund)",
      "sinceVersion": "11.6",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Fix contrib/intarray's GiST opclasses to not fail for empty arrays with `&lt;@`",
      "description": "Fix contrib/intarray's GiST opclasses to not fail for empty arrays with `&lt;@` (Tom Lane)\n          A clause like ``array_column` &lt;@ constant_array` is considered indexable, but the index search may not find empty array values; of course, such entries should trivially match the search.\n          The only practical back-patchable fix for this requires making `&lt;@` index searches scan the whole index, which is what this patch does. This is unfortunate: it means that the query performance is likely worse than a plain sequential scan would be.\n          Applications whose performance is adversely impacted by this change have a couple of options. They could switch to a GIN index, which doesn't have this bug, or they could replace ``array_column` &lt;@ constant_array` with ``array_column` &lt;@ constant_array` AND `array_column` &amp;&amp; `constant_array`. That will provide about the same performance as before, and it will find all non-empty subsets of the given constant array, which is all that could reliably be expected of the query before.",
      "sinceVersion": "11.6",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve performance of hash joins with very large inner relations",
      "description": "Improve performance of hash joins with very large inner relations (Thomas Munro)",
      "sinceVersion": "11.7",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Allow the planner to apply potentially-leaky tests to child-table statistics, if the user can read the corresponding column of the table that's actually named in the query",
      "description": "Allow the planner to apply potentially-leaky tests to child-table statistics, if the user can read the corresponding column of the table that's actually named in the query (Dilip Kumar, Amit Langote)\n          This change fixes a performance problem for partitioned tables that was created by the fix for CVE-2017-7484. That security fix disallowed applying leaky operators to statistics for columns that the current user doesn't have permission to read directly. However, it's somewhat common to grant permissions only on the parent partitioned table and not bother to do so on individual partitions. In such cases, the user can read the column via the parent, so there's no point in this security restriction; it only results in poorer planner estimates than necessary.",
      "sinceVersion": "11.7",
      "significant": false,
      "contributor": "Dilip Kumar, Amit Langote"
    },
    {
      "title": "Repair performance regression in information_schema.triggers view",
      "description": "Repair performance regression in information_schema.triggers view (Tom Lane)\n          This patch redefines that view so that an outer `WHERE` clause constraining the table name can be pushed down into the view, allowing its calculations to be done only for triggers belonging to the table of interest rather than all triggers in the database. In a database with many triggers this would make a significant speed difference for queries of that form. Since things worked that way before v11, this is a potential performance regression. Users who find this to be a problem can fix it by replacing the view definition (or, perhaps, just deleting and reinstalling the whole information_schema schema).",
      "sinceVersion": "11.8",
      "significant": true,
      "contributor": "or, perhaps, just deleting and reinstalling the whole information_schema schema"
    },
    {
      "title": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message",
      "description": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message (Álvaro Herrera)\n          This is a relatively minor problem when using built-in logical replication, because the built-in walreceiver will send a feedback reply (which clears the incorrect state) fairly frequently anyway. But with some other replication systems, such as pglogical, it causes significant performance issues.",
      "sinceVersion": "11.9",
      "significant": true,
      "contributor": "which clears the incorrect state"
    },
    {
      "title": "General performance improvements, including:\n          \n            \n              \n                Optimizations to space utilization and read/write performance for B-tree indexes\n              \n              \n                Partitioning performance enhancements, including improved query performance on tables with thousands of partitions, improved insertion performance with INSERT and COPY, and the ability to execute ALTER TABLE ATTACH PARTITION without blocking queries\n              \n              \n                Automatic",
      "description": "General performance improvements, including:\n          \n            \n              \n                Optimizations to space utilization and read/write performance for B-tree indexes\n              \n              \n                Partitioning performance enhancements, including improved query performance on tables with thousands of partitions, improved insertion performance with INSERT and COPY, and the ability to execute ALTER TABLE ATTACH PARTITION without blocking queries\n              \n              \n                Automatic (but overridable) inlining of common table expressions (CTEs)\n              \n              \n                Reduction of WAL overhead for creation of GiST, GIN, and SP-GiST indexes\n              \n              \n                Support for covering GiST indexes, via the `INCLUDE` clause\n              \n              \n                Multi-column most-common-value (MCV) statistics can be defined via CREATE STATISTICS, to support better plans for queries that test several non-uniformly-distributed columns\n              \n            \n          ",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "MCV"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Optimizations to space utilization and read/write performance for B-tree indexes",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Untitled performance improvement",
      "description": "Partitioning performance enhancements, including improved query performance on tables with thousands of partitions, improved insertion performance with INSERT and COPY, and the ability to execute ALTER TABLE ATTACH PARTITION without blocking queries",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Improve performance by using a new algorithm for output of real and double precision values",
      "description": "Improve performance by using a new algorithm for output of real and double precision values (Andrew Gierth)\n          Previously, displayed floating-point values were rounded to 6 (for real) or 15 (for double precision) digits by default, adjusted by the value of extra_float_digits. Now, whenever extra_float_digits is more than zero (as it now is by default), only the minimum number of digits required to preserve the exact binary value are output. The behavior is the same as before when extra_float_digits is set to zero or less.\n          Also, formatting of floating-point exponents is now uniform across platforms: two digits are used unless three are necessary. In previous releases, Windows builds always printed three digits.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "as it now is by default"
    },
    {
      "title": "Treat object-name columns in the information_schema views as being of type name, not varchar",
      "description": "Treat object-name columns in the information_schema views as being of type name, not varchar (Tom Lane)\n          Per the SQL standard, object-name columns in the information_schema views are declared as being of domain type sql_identifier. In PostgreSQL, the underlying catalog columns are really of type name. This change makes sql_identifier be a domain over name, rather than varchar as before. This eliminates a semantic mismatch in comparison and sorting behavior, which can greatly improve the performance of queries on information_schema views that restrict an object-name column. Note however that inequality restrictions, for example\n          SELECT ... FROM information_schema.tables WHERE table_name &lt; 'foo';\n\n          will now use “C”-locale comparison semantics by default, rather than the database's default collation as before. Sorting on these columns will also follow “C” ordering rules. The previous behavior (and inefficiency) can be enforced by adding a `COLLATE \"default\"` clause.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "and inefficiency"
    },
    {
      "title": "Improve performance of many operations on partitioned tables",
      "description": "Improve performance of many operations on partitioned tables (Amit Langote, David Rowley, Tom Lane, Álvaro Herrera)\n              Allow tables with thousands of child partitions to be processed efficiently by operations that only affect a small number of partitions.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Amit Langote, David Rowley, Tom Lane, Álvaro Herrera"
    },
    {
      "title": "Improve speed of COPY into partitioned tables",
      "description": "Improve speed of COPY into partitioned tables (David Rowley)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve performance and space utilization of btree indexes with many duplicates",
      "description": "Improve performance and space utilization of btree indexes with many duplicates (Peter Geoghegan, Heikki Linnakangas)\n              Previously, duplicate index entries were stored unordered within their duplicate groups. This caused overhead during index inserts, wasted space due to excessive page splits, and it reduced VACUUM's ability to recycle entire pages. Duplicate index entries are now sorted in heap-storage order.\n              Indexes pg_upgrade'd from previous releases will not have these benefits.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Peter Geoghegan, Heikki Linnakangas"
    },
    {
      "title": "Improve speed of btree index insertions by reducing locking overhead",
      "description": "Improve speed of btree index insertions by reducing locking overhead (Alexander Korotkov)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Alexander Korotkov"
    },
    {
      "title": "Improve the performance of vacuum scans of GiST indexes",
      "description": "Improve the performance of vacuum scans of GiST indexes (Andrey Borodin, Konstantin Kuznetsov, Heikki Linnakangas)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Andrey Borodin, Konstantin Kuznetsov, Heikki Linnakangas"
    },
    {
      "title": "Allow CREATE STATISTICS to create most-common-value statistics for multiple columns",
      "description": "Allow CREATE STATISTICS to create most-common-value statistics for multiple columns (Tomas Vondra)\n              This improves optimization for queries that test several columns, requiring an estimate of the combined effect of several `WHERE` clauses. If the columns are correlated and have non-uniform distributions then multi-column statistics will allow much better estimates.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tomas Vondra"
    },
    {
      "title": "Improve optimization of partition and `UNION ALL` queries that have only a single child",
      "description": "Improve optimization of partition and `UNION ALL` queries that have only a single child (David Rowley)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve processing of domains that have no check constraints",
      "description": "Improve processing of domains that have no check constraints (Tom Lane)\n              Domains that are being used purely as type aliases no longer cause optimization difficulties.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve optimization of joins on columns of type tid",
      "description": "Improve optimization of joins on columns of type tid (Tom Lane)\n              These changes primarily improve the efficiency of self-joins on ctid columns.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Fix the leakproofness designations of some btree comparison operators and support functions",
      "description": "Fix the leakproofness designations of some btree comparison operators and support functions (Tom Lane)\n              This allows some optimizations that previously would not have been applied in the presence of security barrier views or row-level security.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Speed up keyword lookup",
      "description": "Speed up keyword lookup (John Naylor, Joerg Sonnenberger, Tom Lane)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "John Naylor, Joerg Sonnenberger, Tom Lane"
    },
    {
      "title": "Improve search performance for multi-byte characters in `position",
      "description": "Improve search performance for multi-byte characters in `position()()` and related functions (Heikki Linnakangas)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Heikki Linnakangas"
    },
    {
      "title": "Improve speed in converting strings to int2 or int4 integers",
      "description": "Improve speed in converting strings to int2 or int4 integers (Andres Freund)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Improve the speed of setting the process title on FreeBSD",
      "description": "Improve the speed of setting the process title on FreeBSD (Thomas Munro)",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Reduce the default value of autovacuum_vacuum_cost_delay to 2ms",
      "description": "Reduce the default value of autovacuum_vacuum_cost_delay to 2ms (Tom Lane)\n              This allows autovacuum operations to proceed faster by default.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow `date_trunc",
      "description": "Allow `date_trunc()()` to have an additional argument to control the time zone (Vik Fearing, Tom Lane)\n            This is faster and simpler than using the `AT TIME ZONE` clause.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Vik Fearing, Tom Lane"
    },
    {
      "title": "Add planner support function interfaces to improve optimizer estimates, inlining, and indexing for functions",
      "description": "Add planner support function interfaces to improve optimizer estimates, inlining, and indexing for functions (Tom Lane)\n            This allows extensions to create planner support functions that can provide function-specific selectivity, cost, and row-count estimates that can depend on the function's arguments. Support functions can also supply simplified representations and index conditions, greatly expanding optimization possibilities.",
      "sinceVersion": "12.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "In ecpglib, avoid redundant `newlocale",
      "description": "In ecpglib, avoid redundant `newlocale()()` calls (Noah Misch)\n          Allocate a C locale object once per process when first connecting, rather than creating and freeing locale objects once per query. This mitigates a libc memory leak on AIX, and may offer some performance benefit everywhere.",
      "sinceVersion": "12.12",
      "significant": false,
      "contributor": "Noah Misch"
    },
    {
      "title": "In Snowball dictionaries, don't try to stem excessively-long words",
      "description": "In Snowball dictionaries, don't try to stem excessively-long words (Olly Betts, Tom Lane)\n          If the input word exceeds 1000 bytes, return it as-is after case folding, rather than trying to run it through the Snowball code. This restriction protects against a known recursion-to-stack-overflow problem in the Turkish stemmer, and it seems like good insurance against any other safety or performance issues that may exist in the Snowball stemmers. Such a long string is surely not a word in any human language, so it's doubtful that the stemmer would have done anything desirable with it anyway.",
      "sinceVersion": "12.13",
      "significant": false,
      "contributor": "Olly Betts, Tom Lane"
    },
    {
      "title": "Honor non-default settings of checkpoint_completion_target",
      "description": "Honor non-default settings of checkpoint_completion_target (Bharath Rupireddy)\n          Internal state was not updated after a change in checkpoint_completion_target, possibly resulting in performing checkpoint I/O faster or slower than desired, especially if that setting was changed on-the-fly.",
      "sinceVersion": "12.14",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Limit the amount of cleanup work done by `get_actual_variable_range",
      "description": "Limit the amount of cleanup work done by `get_actual_variable_range()` (Simon Riggs)\n          Planner runs occurring just after deletion of a large number of tuples appearing at the end of an index could expend significant amounts of work setting the “killed” bits for those index entries. Limit the amount of work done in any one query by giving up on this process after examining 100 heap pages. All the cleanup will still happen eventually, but without so large a performance hiccup.",
      "sinceVersion": "12.14",
      "significant": true,
      "contributor": "Simon Riggs"
    },
    {
      "title": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary",
      "description": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary (Simon Riggs, Michail Nikolaev)\n          Insufficiently-aggressive cleanup of the KnownAssignedXids array could lead to poor performance, particularly when max_connections is set to a large value on the standby.",
      "sinceVersion": "12.14",
      "significant": false,
      "contributor": "Simon Riggs, Michail Nikolaev"
    },
    {
      "title": "Remove faulty assertion in useless-RESULT-RTE optimization logic",
      "description": "Remove faulty assertion in useless-RESULT-RTE optimization logic (Tom Lane)",
      "sinceVersion": "12.14",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs",
      "description": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs (David Rowley)\n          This optimization requires that the aggregate's argument expressions have repeatable results, which might not hold for a sub-SELECT.",
      "sinceVersion": "12.15",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix glitches in `SERIALIZABLE READ ONLY` optimization",
      "description": "Fix glitches in `SERIALIZABLE READ ONLY` optimization (Thomas Munro)\n          Transactions already marked as “doomed” confused the safe-snapshot optimization for `SERIALIZABLE READ ONLY` transactions. The optimization was unnecessarily skipped in some cases. In other cases an assertion failure occurred (but there was no problem in non-assert builds).",
      "sinceVersion": "12.15",
      "significant": false,
      "contributor": "but there was no problem in non-assert builds"
    },
    {
      "title": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions",
      "description": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions (Tom Lane)\n          These places could fail to detect insertion of a volatile function default-argument expression, or decide that a polymorphic function is volatile although it is actually immutable on the datatype of interest. This could lead to improperly rejecting or accepting a `GENERATED` clause, or to mistakenly applying the constant-default-value optimization in ALTER TABLE ADD COLUMN.",
      "sinceVersion": "12.18",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame",
      "description": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame (Vallimaharajan G)\n          When a plain aggregate is used as a window function, and the window frame start is specified as `UNBOUNDED PRECEDING`, the frame's head cannot move so we do not need to use the special (and more expensive) moving-aggregate mode. This optimization was intended all along, but due to a coding error it never triggered.",
      "sinceVersion": "12.19",
      "significant": false,
      "contributor": "and more expensive"
    },
    {
      "title": "Improve performance of hash joins with very large inner relations",
      "description": "Improve performance of hash joins with very large inner relations (Thomas Munro)",
      "sinceVersion": "12.2",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Allow the planner to apply potentially-leaky tests to child-table statistics, if the user can read the corresponding column of the table that's actually named in the query",
      "description": "Allow the planner to apply potentially-leaky tests to child-table statistics, if the user can read the corresponding column of the table that's actually named in the query (Dilip Kumar, Amit Langote)\n          This change fixes a performance problem for partitioned tables that was created by the fix for CVE-2017-7484. That security fix disallowed applying leaky operators to statistics for columns that the current user doesn't have permission to read directly. However, it's somewhat common to grant permissions only on the parent partitioned table and not bother to do so on individual partitions. In such cases, the user can read the column via the parent, so there's no point in this security restriction; it only results in poorer planner estimates than necessary.",
      "sinceVersion": "12.2",
      "significant": false,
      "contributor": "Dilip Kumar, Amit Langote"
    },
    {
      "title": "Repair performance regression in information_schema.triggers view",
      "description": "Repair performance regression in information_schema.triggers view (Tom Lane)\n          This patch redefines that view so that an outer `WHERE` clause constraining the table name can be pushed down into the view, allowing its calculations to be done only for triggers belonging to the table of interest rather than all triggers in the database. In a database with many triggers this would make a significant speed difference for queries of that form. Since things worked that way before v11, this is a potential performance regression. Users who find this to be a problem can fix it by replacing the view definition (or, perhaps, just deleting and reinstalling the whole information_schema schema).",
      "sinceVersion": "12.3",
      "significant": true,
      "contributor": "or, perhaps, just deleting and reinstalling the whole information_schema schema"
    },
    {
      "title": "Repair performance regression in floating point overflow/underflow detection",
      "description": "Repair performance regression in floating point overflow/underflow detection (Emre Hasegeli)\n          Previous refactoring had resulted in `isinf()()` being called extra times in some hot code paths.",
      "sinceVersion": "12.3",
      "significant": false,
      "contributor": "Emre Hasegeli"
    },
    {
      "title": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message",
      "description": "In logical replication walsender, fix failure to send feedback messages after sending a keepalive message (Álvaro Herrera)\n          This is a relatively minor problem when using built-in logical replication, because the built-in walreceiver will send a feedback reply (which clears the incorrect state) fairly frequently anyway. But with some other replication systems, such as pglogical, it causes significant performance issues.",
      "sinceVersion": "12.4",
      "significant": true,
      "contributor": "which clears the incorrect state"
    },
    {
      "title": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns",
      "description": "Avoid misoptimization of subquery qualifications that reference apparently-constant grouping columns (Tom Lane)\n          A “constant” subquery output column isn't really constant if it is a grouping column that appears in only some of the grouping sets.",
      "sinceVersion": "12.5",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "In libpq for Windows, call `WSAStartup",
      "description": "In libpq for Windows, call `WSAStartup()()` once per process and `WSACleanup()()` not at all (Tom Lane, Alexander Lakhin)\n          Previously, libpq invoked `WSAStartup()()` at connection start and `WSACleanup()()` at connection cleanup. However, it appears that calling `WSACleanup()()` can interfere with other program operations; notably, we have observed rare failures to emit expected output to stdout. There appear to be no ill effects from omitting the call, so do that. (This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections.)",
      "sinceVersion": "12.5",
      "significant": false,
      "contributor": "This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections."
    },
    {
      "title": "Avoid `memcpy",
      "description": "Avoid `memcpy()()` with a NULL source pointer and zero count during partitioned index creation (Álvaro Herrera)\n          While such a call is not known to cause problems in itself, some compilers assume that the arguments of `memcpy()()` are never NULL, which could result in incorrect optimization of nearby code.",
      "sinceVersion": "12.6",
      "significant": false,
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Make pg_upgrade carry forward the old installation's `oldestXID` value",
      "description": "Make pg_upgrade carry forward the old installation's `oldestXID` value (Bertrand Drouvot)\n          Previously, the new installation's `oldestXID` was set to a value old enough to (usually) force immediate anti-wraparound autovacuuming. That's not desirable from a performance standpoint; what's worse, installations using large values of autovacuum_freeze_max_age could suffer unwanted forced shutdowns soon after an upgrade.",
      "sinceVersion": "12.8",
      "significant": false,
      "contributor": "usually"
    },
    {
      "title": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal`",
      "description": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal` (Noah Misch)\n          If the server crashed between CREATE TABLESPACE and the next checkpoint, replay would fully remove the contents of the new tablespace's directory, relying on subsequent WAL replay to restore everything within that directory. This interacts badly with optimizations that skip writing WAL (one example is COPY into a just-created table). Such optimizations are applied only when wal_level is `minimal`, which is not the default in v10 and later.",
      "sinceVersion": "12.9",
      "significant": false,
      "contributor": "one example is COPY into a just-created table"
    },
    {
      "title": "Fix regular expression performance bug with back-references inside iteration nodes",
      "description": "Fix regular expression performance bug with back-references inside iteration nodes (Tom Lane)\n          Incorrect back-tracking logic could result in exponential time spent looking for a match. Fortunately the problem is masked in most cases by other optimizations.",
      "sinceVersion": "12.9",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent wraparound of overflowed-subtransaction tracking on standby servers",
      "description": "Prevent wraparound of overflowed-subtransaction tracking on standby servers (Kyotaro Horiguchi, Alexander Korotkov)\n          This oversight could cause significant performance degradation (manifesting as excessive SubtransSLRU traffic) on standby servers.",
      "sinceVersion": "12.9",
      "significant": true,
      "contributor": "manifesting as excessive SubtransSLRU traffic"
    },
    {
      "title": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type",
      "description": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type()()` (Tom Lane)\n          These changes provide only marginal improvement when dumping from a local server, but a dump from a remote server can benefit substantially due to fewer network round-trips.",
      "sinceVersion": "12.9",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Add spinlock support for the RISC-V architecture",
      "description": "Add spinlock support for the RISC-V architecture (Marek Szuba)\n          This is essential for reasonable performance on that platform.",
      "sinceVersion": "12.9",
      "significant": false,
      "contributor": "Marek Szuba"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Space savings and performance gains from de-duplication of B-tree index entries",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Untitled performance improvement",
      "description": "Improved performance for queries that use aggregates or partitioned tables",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Improve the performance of sorting inet values",
      "description": "Improve the performance of sorting inet values (Brandur Leach)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Brandur Leach"
    },
    {
      "title": "Improve performance when replaying DROP DATABASE commands when many tablespaces are in use",
      "description": "Improve performance when replaying DROP DATABASE commands when many tablespaces are in use (Fujii Masao)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Fujii Masao"
    },
    {
      "title": "Improve performance for truncation of very large relations",
      "description": "Improve performance for truncation of very large relations (Kirk Jamison)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Kirk Jamison"
    },
    {
      "title": "Improve performance of LISTEN/NOTIFY",
      "description": "Improve performance of LISTEN/NOTIFY (Martijn van Oosterhout, Tom Lane)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Martijn van Oosterhout, Tom Lane"
    },
    {
      "title": "Speed up conversions of integers to text",
      "description": "Speed up conversions of integers to text (David Fetter)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "David Fetter"
    },
    {
      "title": "Improve performance of wait events on BSD-based systems",
      "description": "Improve performance of wait events on BSD-based systems (Thomas Munro)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Improve the performance and accuracy of the numeric type's square root",
      "description": "Improve the performance and accuracy of the numeric type's square root (`sqrt()`) and natural log (`ln()`) functions (Dean Rasheed)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Dean Rasheed"
    },
    {
      "title": "Improve performance of simple PL/pgSQL expressions",
      "description": "Improve performance of simple PL/pgSQL expressions (Tom Lane, Amit Langote)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Tom Lane, Amit Langote"
    },
    {
      "title": "Improve performance of PL/pgSQL functions that use immutable expressions",
      "description": "Improve performance of PL/pgSQL functions that use immutable expressions (Konstantin Knizhnik)",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Konstantin Knizhnik"
    },
    {
      "title": "Allow pgbench to partition its “accounts” table",
      "description": "Allow pgbench to partition its “accounts” table (Fabien Coelho)\n              This allows performance testing of partitioning.",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Fabien Coelho"
    },
    {
      "title": "Implement internal lists as arrays, rather than a chain of cells",
      "description": "Implement internal lists as arrays, rather than a chain of cells (Tom Lane)\n            This improves performance for queries that access many objects.",
      "sinceVersion": "13.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "In libpq for Windows, call `WSAStartup",
      "description": "In libpq for Windows, call `WSAStartup()()` once per process and `WSACleanup()()` not at all (Tom Lane, Alexander Lakhin)\n          Previously, libpq invoked `WSAStartup()()` at connection start and `WSACleanup()()` at connection cleanup. However, it appears that calling `WSACleanup()()` can interfere with other program operations; notably, we have observed rare failures to emit expected output to stdout. There appear to be no ill effects from omitting the call, so do that. (This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections.)",
      "sinceVersion": "13.1",
      "significant": false,
      "contributor": "This also eliminates a performance issue from repeated DLL loads and unloads when a program performs a series of database connections."
    },
    {
      "title": "Honor non-default settings of checkpoint_completion_target",
      "description": "Honor non-default settings of checkpoint_completion_target (Bharath Rupireddy)\n          Internal state was not updated after a change in checkpoint_completion_target, possibly resulting in performing checkpoint I/O faster or slower than desired, especially if that setting was changed on-the-fly.",
      "sinceVersion": "13.10",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Limit the amount of cleanup work done by `get_actual_variable_range",
      "description": "Limit the amount of cleanup work done by `get_actual_variable_range()` (Simon Riggs)\n          Planner runs occurring just after deletion of a large number of tuples appearing at the end of an index could expend significant amounts of work setting the “killed” bits for those index entries. Limit the amount of work done in any one query by giving up on this process after examining 100 heap pages. All the cleanup will still happen eventually, but without so large a performance hiccup.",
      "sinceVersion": "13.10",
      "significant": true,
      "contributor": "Simon Riggs"
    },
    {
      "title": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary",
      "description": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary (Simon Riggs, Michail Nikolaev)\n          Insufficiently-aggressive cleanup of the KnownAssignedXids array could lead to poor performance, particularly when max_connections is set to a large value on the standby.",
      "sinceVersion": "13.10",
      "significant": false,
      "contributor": "Simon Riggs, Michail Nikolaev"
    },
    {
      "title": "Remove faulty assertion in useless-RESULT-RTE optimization logic",
      "description": "Remove faulty assertion in useless-RESULT-RTE optimization logic (Tom Lane)",
      "sinceVersion": "13.10",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs",
      "description": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs (David Rowley)\n          This optimization requires that the aggregate's argument expressions have repeatable results, which might not hold for a sub-SELECT.",
      "sinceVersion": "13.11",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix glitches in `SERIALIZABLE READ ONLY` optimization",
      "description": "Fix glitches in `SERIALIZABLE READ ONLY` optimization (Thomas Munro)\n          Transactions already marked as “doomed” confused the safe-snapshot optimization for `SERIALIZABLE READ ONLY` transactions. The optimization was unnecessarily skipped in some cases. In other cases an assertion failure occurred (but there was no problem in non-assert builds).",
      "sinceVersion": "13.11",
      "significant": false,
      "contributor": "but there was no problem in non-assert builds"
    },
    {
      "title": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions",
      "description": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions (Tom Lane)\n          These places could fail to detect insertion of a volatile function default-argument expression, or decide that a polymorphic function is volatile although it is actually immutable on the datatype of interest. This could lead to improperly rejecting or accepting a `GENERATED` clause, or to mistakenly applying the constant-default-value optimization in ALTER TABLE ADD COLUMN.",
      "sinceVersion": "13.14",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame",
      "description": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame (Vallimaharajan G)\n          When a plain aggregate is used as a window function, and the window frame start is specified as `UNBOUNDED PRECEDING`, the frame's head cannot move so we do not need to use the special (and more expensive) moving-aggregate mode. This optimization was intended all along, but due to a coding error it never triggered.",
      "sinceVersion": "13.15",
      "significant": false,
      "contributor": "and more expensive"
    },
    {
      "title": "Avoid `memcpy",
      "description": "Avoid `memcpy()()` with a NULL source pointer and zero count during partitioned index creation (Álvaro Herrera)\n          While such a call is not known to cause problems in itself, some compilers assume that the arguments of `memcpy()()` are never NULL, which could result in incorrect optimization of nearby code.",
      "sinceVersion": "13.2",
      "significant": false,
      "contributor": "Álvaro Herrera"
    },
    {
      "title": "Disable the vacuum_cleanup_index_scale_factor parameter and storage option",
      "description": "Disable the vacuum_cleanup_index_scale_factor parameter and storage option (Peter Geoghegan)\n          The notion of tracking “stale” index statistics proved to interact badly with the autovacuum_vacuum_insert_threshold parameter, resulting in unnecessary full-index scans and consequent degradation of autovacuum performance. The latter mechanism seems superior, so remove the stale-statistics logic. The control parameter for that, vacuum_cleanup_index_scale_factor, will be removed entirely in v14. In v13, it remains present to avoid breaking existing configuration files, but it no longer does anything.",
      "sinceVersion": "13.3",
      "significant": false,
      "contributor": "Peter Geoghegan"
    },
    {
      "title": "Make pg_upgrade carry forward the old installation's `oldestXID` value",
      "description": "Make pg_upgrade carry forward the old installation's `oldestXID` value (Bertrand Drouvot)\n          Previously, the new installation's `oldestXID` was set to a value old enough to (usually) force immediate anti-wraparound autovacuuming. That's not desirable from a performance standpoint; what's worse, installations using large values of autovacuum_freeze_max_age could suffer unwanted forced shutdowns soon after an upgrade.",
      "sinceVersion": "13.4",
      "significant": false,
      "contributor": "usually"
    },
    {
      "title": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal`",
      "description": "Prevent data loss during crash recovery of CREATE TABLESPACE, when wal_level = `minimal` (Noah Misch)\n          If the server crashed between CREATE TABLESPACE and the next checkpoint, replay would fully remove the contents of the new tablespace's directory, relying on subsequent WAL replay to restore everything within that directory. This interacts badly with optimizations that skip writing WAL (one example is COPY into a just-created table). Such optimizations are applied only when wal_level is `minimal`, which is not the default in v10 and later.",
      "sinceVersion": "13.5",
      "significant": false,
      "contributor": "one example is COPY into a just-created table"
    },
    {
      "title": "Fix regular expression performance bug with back-references inside iteration nodes",
      "description": "Fix regular expression performance bug with back-references inside iteration nodes (Tom Lane)\n          Incorrect back-tracking logic could result in exponential time spent looking for a match. Fortunately the problem is masked in most cases by other optimizations.",
      "sinceVersion": "13.5",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent wraparound of overflowed-subtransaction tracking on standby servers",
      "description": "Prevent wraparound of overflowed-subtransaction tracking on standby servers (Kyotaro Horiguchi, Alexander Korotkov)\n          This oversight could cause significant performance degradation (manifesting as excessive SubtransSLRU traffic) on standby servers.",
      "sinceVersion": "13.5",
      "significant": true,
      "contributor": "manifesting as excessive SubtransSLRU traffic"
    },
    {
      "title": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type",
      "description": "Improve pg_dump's performance by avoiding making per-table queries for RLS policies, and by avoiding repetitive calls to `format_type()()` (Tom Lane)\n          These changes provide only marginal improvement when dumping from a local server, but a dump from a remote server can benefit substantially due to fewer network round-trips.",
      "sinceVersion": "13.5",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Add spinlock support for the RISC-V architecture",
      "description": "Add spinlock support for the RISC-V architecture (Marek Szuba)\n          This is essential for reasonable performance on that platform.",
      "sinceVersion": "13.5",
      "significant": false,
      "contributor": "Marek Szuba"
    },
    {
      "title": "Improve performance of walsenders sending logical changes by avoiding unnecessary cache accesses",
      "description": "Improve performance of walsenders sending logical changes by avoiding unnecessary cache accesses (Hou Zhijie)",
      "sinceVersion": "13.6",
      "significant": false,
      "contributor": "Hou Zhijie"
    },
    {
      "title": "In ecpglib, avoid redundant `newlocale",
      "description": "In ecpglib, avoid redundant `newlocale()()` calls (Noah Misch)\n          Allocate a C locale object once per process when first connecting, rather than creating and freeing locale objects once per query. This mitigates a libc memory leak on AIX, and may offer some performance benefit everywhere.",
      "sinceVersion": "13.8",
      "significant": false,
      "contributor": "Noah Misch"
    },
    {
      "title": "In Snowball dictionaries, don't try to stem excessively-long words",
      "description": "In Snowball dictionaries, don't try to stem excessively-long words (Olly Betts, Tom Lane)\n          If the input word exceeds 1000 bytes, return it as-is after case folding, rather than trying to run it through the Snowball code. This restriction protects against a known recursion-to-stack-overflow problem in the Turkish stemmer, and it seems like good insurance against any other safety or performance issues that may exist in the Snowball stemmers. Such a long string is surely not a word in any human language, so it's doubtful that the stemmer would have done anything desirable with it anyway.",
      "sinceVersion": "13.9",
      "significant": false,
      "contributor": "Olly Betts, Tom Lane"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Numerous performance improvements have been made for parallel queries, heavily-concurrent workloads, partitioned tables, logical replication, and vacuuming.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Prevent the containment operators",
      "description": "Prevent the containment operators (`&lt;@` and `@&gt;`) for intarray from using GiST indexes (Tom Lane)\n          Previously a full GiST index scan was required, so just avoid that and scan the heap, which is faster. Indexes created for this purpose should be removed.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow vacuum to skip index vacuuming when the number of removable index entries is insignificant",
      "description": "Allow vacuum to skip index vacuuming when the number of removable index entries is insignificant (Masahiko Sawada, Peter Geoghegan)\n              The vacuum parameter `INDEX_CLEANUP` has a new default of `auto` that enables this optimization.",
      "sinceVersion": "14.0",
      "significant": true,
      "contributor": "Masahiko Sawada, Peter Geoghegan"
    },
    {
      "title": "Speed up vacuuming of databases with many relations",
      "description": "Speed up vacuuming of databases with many relations (Tatsuhito Kasahara)",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Tatsuhito Kasahara"
    },
    {
      "title": "Improve the performance of updates and deletes on partitioned tables with many partitions",
      "description": "Improve the performance of updates and deletes on partitioned tables with many partitions (Amit Langote, Tom Lane)\n              This change greatly reduces the planner's overhead for such cases, and also allows updates/deletes on partitioned tables to use execution-time partition pruning.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Amit Langote, Tom Lane"
    },
    {
      "title": "Allow some GiST indexes to be built by presorting the data",
      "description": "Allow some GiST indexes to be built by presorting the data (Andrey Borodin)\n              Presorting happens automatically and allows for faster index creation and smaller indexes.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Andrey Borodin"
    },
    {
      "title": "Improve the speed of computing MVCC visibility snapshots on systems with many CPUs and high session counts",
      "description": "Improve the speed of computing MVCC visibility snapshots on systems with many CPUs and high session counts (Andres Freund)\n              This also improves performance when there are many idle sessions.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Andres Freund"
    },
    {
      "title": "Improve the I/O performance of parallel sequential scans",
      "description": "Improve the I/O performance of parallel sequential scans (Thomas Munro, David Rowley)\n              This was done by allocating blocks in groups to parallel workers.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Thomas Munro, David Rowley"
    },
    {
      "title": "Improve performance of regular expression searches",
      "description": "Improve performance of regular expression searches (Tom Lane)",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Dramatically improve Unicode normalization performance",
      "description": "Dramatically improve Unicode normalization performance (John Naylor)\n              This speeds `normalize()()` and `IS NORMALIZED`.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "John Naylor"
    },
    {
      "title": "Speed truncation of small tables during recovery on clusters with a large number of shared buffers",
      "description": "Speed truncation of small tables during recovery on clusters with a large number of shared buffers (Kirk Jamison)",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Kirk Jamison"
    },
    {
      "title": "Allow file system sync at the start of crash recovery on Linux",
      "description": "Allow file system sync at the start of crash recovery on Linux (Thomas Munro)\n            By default, PostgreSQL opens and fsyncs each data file in the database cluster at the start of crash recovery. A new setting, recovery_init_sync_method`=syncfs`, instead syncs each filesystem used by the cluster. This allows for faster recovery on systems with many database files.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Allow logical replication subscriptions to use binary transfer mode",
      "description": "Allow logical replication subscriptions to use binary transfer mode (Dave Cramer)\n              This is faster than text mode, but slightly less robust.",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Dave Cramer"
    },
    {
      "title": "Improve the performance of COPY FROM in binary mode",
      "description": "Improve the performance of COPY FROM in binary mode (Bharath Rupireddy, Amit Langote)",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Bharath Rupireddy, Amit Langote"
    },
    {
      "title": "Improve performance of repeated CALLs within plpgsql procedures",
      "description": "Improve performance of repeated CALLs within plpgsql procedures (Pavel Stehule, Tom Lane)",
      "sinceVersion": "14.0",
      "significant": false,
      "contributor": "Pavel Stehule, Tom Lane"
    },
    {
      "title": "Prevent wraparound of overflowed-subtransaction tracking on standby servers",
      "description": "Prevent wraparound of overflowed-subtransaction tracking on standby servers (Kyotaro Horiguchi, Alexander Korotkov)\n          This oversight could cause significant performance degradation (manifesting as excessive SubtransSLRU traffic) on standby servers.",
      "sinceVersion": "14.1",
      "significant": true,
      "contributor": "manifesting as excessive SubtransSLRU traffic"
    },
    {
      "title": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions",
      "description": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions (Tom Lane)\n          These places could fail to detect insertion of a volatile function default-argument expression, or decide that a polymorphic function is volatile although it is actually immutable on the datatype of interest. This could lead to improperly rejecting or accepting a `GENERATED` clause, or to mistakenly applying the constant-default-value optimization in ALTER TABLE ADD COLUMN.",
      "sinceVersion": "14.11",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame",
      "description": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame (Vallimaharajan G)\n          When a plain aggregate is used as a window function, and the window frame start is specified as `UNBOUNDED PRECEDING`, the frame's head cannot move so we do not need to use the special (and more expensive) moving-aggregate mode. This optimization was intended all along, but due to a coding error it never triggered.",
      "sinceVersion": "14.12",
      "significant": false,
      "contributor": "and more expensive"
    },
    {
      "title": "Improve performance of walsenders sending logical changes by avoiding unnecessary cache accesses",
      "description": "Improve performance of walsenders sending logical changes by avoiding unnecessary cache accesses (Hou Zhijie)",
      "sinceVersion": "14.2",
      "significant": false,
      "contributor": "Hou Zhijie"
    },
    {
      "title": "Make the server more robust against missed timer interrupts",
      "description": "Make the server more robust against missed timer interrupts (Michael Harris, Tom Lane)\n          An optimization added in v14 meant that if a server process somehow missed a timer interrupt, it would never again ask the kernel for another one, thus breaking timeout detection for the remainder of the session. This seems unduly fragile, so add a recovery path.",
      "sinceVersion": "14.3",
      "significant": false,
      "contributor": "Michael Harris, Tom Lane"
    },
    {
      "title": "Prevent possible corruption of indexes created or rebuilt with the `CONCURRENTLY` option",
      "description": "Prevent possible corruption of indexes created or rebuilt with the `CONCURRENTLY` option (Álvaro Herrera)\n          An optimization added in v14 caused CREATE INDEX ... CONCURRENTLY and REINDEX ... CONCURRENTLY to sometimes miss indexing rows that were updated during the index build. Revert that optimization. It is recommended that any indexes made with the `CONCURRENTLY` option be rebuilt after installing this update. (Alternatively, rebuild them without `CONCURRENTLY`.)",
      "sinceVersion": "14.4",
      "significant": false,
      "contributor": "Alternatively, rebuild them without `CONCURRENTLY`."
    },
    {
      "title": "In ecpglib, avoid redundant `newlocale",
      "description": "In ecpglib, avoid redundant `newlocale()()` calls (Noah Misch)\n          Allocate a C locale object once per process when first connecting, rather than creating and freeing locale objects once per query. This mitigates a libc memory leak on AIX, and may offer some performance benefit everywhere.",
      "sinceVersion": "14.5",
      "significant": false,
      "contributor": "Noah Misch"
    },
    {
      "title": "In Snowball dictionaries, don't try to stem excessively-long words",
      "description": "In Snowball dictionaries, don't try to stem excessively-long words (Olly Betts, Tom Lane)\n          If the input word exceeds 1000 bytes, return it as-is after case folding, rather than trying to run it through the Snowball code. This restriction protects against a known recursion-to-stack-overflow problem in the Turkish stemmer, and it seems like good insurance against any other safety or performance issues that may exist in the Snowball stemmers. Such a long string is surely not a word in any human language, so it's doubtful that the stemmer would have done anything desirable with it anyway.",
      "sinceVersion": "14.6",
      "significant": false,
      "contributor": "Olly Betts, Tom Lane"
    },
    {
      "title": "Honor non-default settings of checkpoint_completion_target",
      "description": "Honor non-default settings of checkpoint_completion_target (Bharath Rupireddy)\n          Internal state was not updated after a change in checkpoint_completion_target, possibly resulting in performing checkpoint I/O faster or slower than desired, especially if that setting was changed on-the-fly.",
      "sinceVersion": "14.7",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Limit the amount of cleanup work done by `get_actual_variable_range",
      "description": "Limit the amount of cleanup work done by `get_actual_variable_range()` (Simon Riggs)\n          Planner runs occurring just after deletion of a large number of tuples appearing at the end of an index could expend significant amounts of work setting the “killed” bits for those index entries. Limit the amount of work done in any one query by giving up on this process after examining 100 heap pages. All the cleanup will still happen eventually, but without so large a performance hiccup.",
      "sinceVersion": "14.7",
      "significant": true,
      "contributor": "Simon Riggs"
    },
    {
      "title": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary",
      "description": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary (Simon Riggs, Michail Nikolaev)\n          Insufficiently-aggressive cleanup of the KnownAssignedXids array could lead to poor performance, particularly when max_connections is set to a large value on the standby.",
      "sinceVersion": "14.7",
      "significant": false,
      "contributor": "Simon Riggs, Michail Nikolaev"
    },
    {
      "title": "Remove faulty assertion in useless-RESULT-RTE optimization logic",
      "description": "Remove faulty assertion in useless-RESULT-RTE optimization logic (Tom Lane)",
      "sinceVersion": "14.7",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs",
      "description": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs (David Rowley)\n          This optimization requires that the aggregate's argument expressions have repeatable results, which might not hold for a sub-SELECT.",
      "sinceVersion": "14.8",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix glitches in `SERIALIZABLE READ ONLY` optimization",
      "description": "Fix glitches in `SERIALIZABLE READ ONLY` optimization (Thomas Munro)\n          Transactions already marked as “doomed” confused the safe-snapshot optimization for `SERIALIZABLE READ ONLY` transactions. The optimization was unnecessarily skipped in some cases. In other cases an assertion failure occurred (but there was no problem in non-assert builds).",
      "sinceVersion": "14.8",
      "significant": false,
      "contributor": "but there was no problem in non-assert builds"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Performance improvements, particularly for in-memory and on-disk sorting.",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Improve lookup performance of GiST indexes that were built using sorting",
      "description": "Improve lookup performance of GiST indexes that were built using sorting (Aliaksandr Kalenik, Sergei Shoulbakov, Andrey Borodin)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Aliaksandr Kalenik, Sergei Shoulbakov, Andrey Borodin"
    },
    {
      "title": "Speed up encoding validation of UTF-8 text by processing 16 bytes at a time",
      "description": "Speed up encoding validation of UTF-8 text by processing 16 bytes at a time (John Naylor, Heikki Linnakangas)\n              This will improve text-heavy operations like COPY FROM.",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "John Naylor, Heikki Linnakangas"
    },
    {
      "title": "Improve performance for sorts that exceed work_mem",
      "description": "Improve performance for sorts that exceed work_mem (Heikki Linnakangas)\n              When the sort data no longer fits in work_mem, switch to a batch sorting algorithm that uses more output streams than before.",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Heikki Linnakangas"
    },
    {
      "title": "Improve performance and reduce memory consumption of in-memory sorts",
      "description": "Improve performance and reduce memory consumption of in-memory sorts (Ronan Dunklau, David Rowley, Thomas Munro, John Naylor)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Ronan Dunklau, David Rowley, Thomas Munro, John Naylor"
    },
    {
      "title": "Improve the performance of window functions that use `row_number",
      "description": "Improve the performance of window functions that use `row_number()()`, `rank()()`, `dense_rank()()` and `count()()` (David Rowley)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve the performance of spinlocks on high-core-count ARM64 systems",
      "description": "Improve the performance of spinlocks on high-core-count ARM64 systems (Geoffrey Blake)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Geoffrey Blake"
    },
    {
      "title": "Run the checkpointer and bgwriter processes during crash recovery",
      "description": "Run the checkpointer and bgwriter processes during crash recovery (Thomas Munro)\n            This helps to speed up long crash recoveries.",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Thomas Munro"
    },
    {
      "title": "Improve performance of psql's \\copy command, by sending data in larger chunks",
      "description": "Improve performance of psql's \\copy command, by sending data in larger chunks (Heikki Linnakangas)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Heikki Linnakangas"
    },
    {
      "title": "Improve performance of dumping databases with many objects",
      "description": "Improve performance of dumping databases with many objects (Tom Lane)\n              This will also improve the performance of pg_upgrade.",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve parallel pg_dump's performance for tables with large TOAST tables",
      "description": "Improve parallel pg_dump's performance for tables with large TOAST tables (Tom Lane)",
      "sinceVersion": "15.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Honor non-default settings of checkpoint_completion_target",
      "description": "Honor non-default settings of checkpoint_completion_target (Bharath Rupireddy)\n          Internal state was not updated after a change in checkpoint_completion_target, possibly resulting in performing checkpoint I/O faster or slower than desired, especially if that setting was changed on-the-fly.",
      "sinceVersion": "15.2",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Fix possible dangling-pointer access during execution of window function run-condition expressions",
      "description": "Fix possible dangling-pointer access during execution of window function run-condition expressions (David Rowley)\n          In practice, because the run-condition optimization is only applied to certain window functions that happen to all return int8, this only manifested as a problem on 32-bit builds.",
      "sinceVersion": "15.2",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Limit the amount of cleanup work done by `get_actual_variable_range",
      "description": "Limit the amount of cleanup work done by `get_actual_variable_range()` (Simon Riggs)\n          Planner runs occurring just after deletion of a large number of tuples appearing at the end of an index could expend significant amounts of work setting the “killed” bits for those index entries. Limit the amount of work done in any one query by giving up on this process after examining 100 heap pages. All the cleanup will still happen eventually, but without so large a performance hiccup.",
      "sinceVersion": "15.2",
      "significant": true,
      "contributor": "Simon Riggs"
    },
    {
      "title": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary",
      "description": "In hot-standby servers, reduce processing effort for tracking XIDs known to be active on the primary (Simon Riggs, Michail Nikolaev)\n          Insufficiently-aggressive cleanup of the KnownAssignedXids array could lead to poor performance, particularly when max_connections is set to a large value on the standby.",
      "sinceVersion": "15.2",
      "significant": false,
      "contributor": "Simon Riggs, Michail Nikolaev"
    },
    {
      "title": "Remove faulty assertion in useless-RESULT-RTE optimization logic",
      "description": "Remove faulty assertion in useless-RESULT-RTE optimization logic (Tom Lane)",
      "sinceVersion": "15.2",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs",
      "description": "Disable the inverse-transition optimization for window aggregates when the call contains sub-SELECTs (David Rowley)\n          This optimization requires that the aggregate's argument expressions have repeatable results, which might not hold for a sub-SELECT.",
      "sinceVersion": "15.3",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Fix glitches in `SERIALIZABLE READ ONLY` optimization",
      "description": "Fix glitches in `SERIALIZABLE READ ONLY` optimization (Thomas Munro)\n          Transactions already marked as “doomed” confused the safe-snapshot optimization for `SERIALIZABLE READ ONLY` transactions. The optimization was unnecessarily skipped in some cases. In other cases an assertion failure occurred (but there was no problem in non-assert builds).",
      "sinceVersion": "15.3",
      "significant": false,
      "contributor": "but there was no problem in non-assert builds"
    },
    {
      "title": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions",
      "description": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions (Tom Lane)\n          These places could fail to detect insertion of a volatile function default-argument expression, or decide that a polymorphic function is volatile although it is actually immutable on the datatype of interest. This could lead to improperly rejecting or accepting a `GENERATED` clause, or to mistakenly applying the constant-default-value optimization in ALTER TABLE ADD COLUMN.",
      "sinceVersion": "15.6",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent potentially-incorrect optimization of some window functions",
      "description": "Prevent potentially-incorrect optimization of some window functions (David Rowley)\n          Disable “run condition” optimization of `ntile()()` and `count()()` with non-constant arguments. This avoids possible misbehavior with sub-selects, typically leading to errors like “WindowFunc not found in subplan target lists”.",
      "sinceVersion": "15.7",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame",
      "description": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame (Vallimaharajan G)\n          When a plain aggregate is used as a window function, and the window frame start is specified as `UNBOUNDED PRECEDING`, the frame's head cannot move so we do not need to use the special (and more expensive) moving-aggregate mode. This optimization was intended all along, but due to a coding error it never triggered.",
      "sinceVersion": "15.7",
      "significant": false,
      "contributor": "and more expensive"
    },
    {
      "title": "Untitled performance improvement",
      "description": "Improve performance of vacuum freezing",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Allow window functions to use the faster `ROWS` mode internally when `RANGE` mode is active but unnecessary",
      "description": "Allow window functions to use the faster `ROWS` mode internally when `RANGE` mode is active but unnecessary (David Rowley)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Allow optimization of always-increasing window functions `ntile",
      "description": "Allow optimization of always-increasing window functions `ntile()()`, `cume_dist()()` and `percent_rank()()` (David Rowley)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve performance by caching `RANGE` and `LIST` partition lookups",
      "description": "Improve performance by caching `RANGE` and `LIST` partition lookups (Amit Langote, Hou Zhijie, David Rowley)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "Amit Langote, Hou Zhijie, David Rowley"
    },
    {
      "title": "Improve the speed of updating the process title",
      "description": "Improve the speed of updating the process title (David Rowley)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Improve performance of server variable management",
      "description": "Improve performance of server variable management (Tom Lane)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Improve performance for logical replication apply without a primary key",
      "description": "Improve performance for logical replication apply without a primary key (Onder Kalaci, Amit Kapila)\n            Specifically, `REPLICA IDENTITY FULL` can now use btree indexes rather than sequentially scanning the table to find matches.",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "Onder Kalaci, Amit Kapila"
    },
    {
      "title": "Use new VACUUM options to improve the performance of vacuumdb",
      "description": "Use new VACUUM options to improve the performance of vacuumdb (Tom Lane, Nathan Bossart)",
      "sinceVersion": "16.0",
      "significant": false,
      "contributor": "Tom Lane, Nathan Bossart"
    },
    {
      "title": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions",
      "description": "Fix function volatility checking for `GENERATED` and `DEFAULT` expressions (Tom Lane)\n          These places could fail to detect insertion of a volatile function default-argument expression, or decide that a polymorphic function is volatile although it is actually immutable on the datatype of interest. This could lead to improperly rejecting or accepting a `GENERATED` clause, or to mistakenly applying the constant-default-value optimization in ALTER TABLE ADD COLUMN.",
      "sinceVersion": "16.2",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Prevent potentially-incorrect optimization of some window functions",
      "description": "Prevent potentially-incorrect optimization of some window functions (David Rowley)\n          Disable “run condition” optimization of `ntile()()` and `count()()` with non-constant arguments. This avoids possible misbehavior with sub-selects, typically leading to errors like “WindowFunc not found in subplan target lists”.",
      "sinceVersion": "16.3",
      "significant": false,
      "contributor": "David Rowley"
    },
    {
      "title": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame",
      "description": "Avoid unnecessary use of moving-aggregate mode with a non-moving window frame (Vallimaharajan G)\n          When a plain aggregate is used as a window function, and the window frame start is specified as `UNBOUNDED PRECEDING`, the frame's head cannot move so we do not need to use the special (and more expensive) moving-aggregate mode. This optimization was intended all along, but due to a coding error it never triggered.",
      "sinceVersion": "16.3",
      "significant": false,
      "contributor": "and more expensive"
    },
    {
      "title": "Use a hash table instead of linear search for “catcache list” objects",
      "description": "Use a hash table instead of linear search for “catcache list” objects (Tom Lane)\n          This change solves performance problems that were reported for certain operations in installations with many thousands of roles.",
      "sinceVersion": "16.3",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Untitled performance improvement",
      "description": "New memory management system for VACUUM, which reduces memory consumption and can improve overall vacuuming performance.",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Untitled performance improvement",
      "description": "Various query performance improvements, including for sequential reads using streaming I/O, write throughput under high concurrency, and searches over multiple values in a btree index.",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": null
    },
    {
      "title": "Improve optimization of `IS NOT NULL` and `IS NULL` query restrictions",
      "description": "Improve optimization of `IS NOT NULL` and `IS NULL` query restrictions (David Rowley, Richard Guo, Andy Fan) § §\n              Remove `IS NOT NULL` restrictions from queries on `NOT NULL` columns and eliminate scans on `NOT NULL` columns if `IS NULL` is specified.",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "David Rowley, Richard Guo, Andy Fan"
    },
    {
      "title": "Improve optimization of range values when using containment operators &lt;@ and @&gt;",
      "description": "Improve optimization of range values when using containment operators &lt;@ and @&gt; (Kim Johan Andersson, Jian He) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Kim Johan Andersson, Jian He"
    },
    {
      "title": "Improve optimization of the `LIMIT` clause on partitioned tables, inheritance parents, and `UNION ALL` queries",
      "description": "Improve optimization of the `LIMIT` clause on partitioned tables, inheritance parents, and `UNION ALL` queries (Andy Fan, David Rowley) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Andy Fan, David Rowley"
    },
    {
      "title": "Improve performance when checking roles with many memberships",
      "description": "Improve performance when checking roles with many memberships (Nathan Bossart) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Nathan Bossart"
    },
    {
      "title": "Improve performance of heavily-contended WAL writes",
      "description": "Improve performance of heavily-contended WAL writes (Bharath Rupireddy) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Bharath Rupireddy"
    },
    {
      "title": "Improve performance when transferring large blocks of data to a client",
      "description": "Improve performance when transferring large blocks of data to a client (Melih Mutlu) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Melih Mutlu"
    },
    {
      "title": "Improve logical decoding performance in cases where there are many subtransactions",
      "description": "Improve logical decoding performance in cases where there are many subtransactions (Masahiko Sawada) §",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Masahiko Sawada"
    },
    {
      "title": "Add pg_restore option --transaction-size to allow object restores in transaction batches",
      "description": "Add pg_restore option --transaction-size to allow object restores in transaction batches (Tom Lane) §\n            This allows the performance benefits of transaction batches without the problems of excessively large transaction blocks.",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Tom Lane"
    },
    {
      "title": "Allow ALTER OPERATOR to set more optimization attributes",
      "description": "Allow ALTER OPERATOR to set more optimization attributes (Tommy Pavlicek) §\n            This is useful for extensions.",
      "sinceVersion": "17.0",
      "significant": false,
      "contributor": "Tommy Pavlicek"
    }
  ]
}